{
  "backend/main.mo": "Motoko canister managing clients, tasks, assignees, and user profiles with per-caller storage and authorization checks.",
  "feature_evidence.json": "Report mapping reliability/stability features to impacted frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind base styles defining OKLCH-based light/dark theme tokens and global background/foreground rules.",
  "frontend/index.html": "HTML entry point containing root div, favicon, and script loader for the React app.",
  "frontend/src/App.tsx": "Main React app configuring routes, defensive initialization, URL cleanup deferral, and top-level error boundaries.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog for uploading assignees via CSV with parsing, validation, error handling, and bulk create mutation.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting assignees with form validation and mutation hooks.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their display name.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing screen for signed-out users with Internet Identity login and feature overview cards.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "CSV-based bulk client upload dialog that parses, validates, and submits multiple client records.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog for creating, editing, and deleting individual clients with validation and mutation logic.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "Error boundary capturing startup errors and displaying a fallback screen.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Fallback UI prompting the user to reload the page after an app startup error.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, header, user menu, and responsive mobile sidebar.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing selected tasks, collecting optional field updates and submitting them via bulkUpdateTasks.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for uploading tasks from CSV, validating parsed rows, previewing them, and submitting bulk creation.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Read‑only task details display component showing status, dates, financials, and optional fields.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Form dialog for creating or editing a single task, handling all editable task fields and submission logic.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline status selector allowing quick task status updates using updateTask.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses and helpers for normalizing, validating, and displaying status values.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for fetching, creating, updating, deleting, and bulk‑managing assignees through the backend actor.",
  "frontend/src/hooks/clients.ts": "React-query hooks for CRUD and bulk operations on clients via the backend actor.",
  "frontend/src/hooks/tasks.ts": "React-query hooks for fetching, creating, updating, deleting, and bulk operations on tasks.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and save the authenticated user's profile using the actor.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Runs deferred URL cleanup after component mount using a timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login, logout, and identity loading.",
  "frontend/src/index.css": "Tailwind CSS setup with custom design tokens for light and dark themes.",
  "frontend/src/lib/dataParser.ts": "Deprecated utilities for parsing and encoding legacy client data structures.",
  "frontend/src/main.tsx": "Application entry that sets up React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AssigneesPage.tsx": "UI page for listing, searching, editing, and bulk deleting assignees with dialogs and filtering.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays a single client's details, loads related tasks, computes task stats, and provides edit and task creation dialogs.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients with search, selection, bulk deletion, and dialogs for adding or bulk uploading clients.",
  "frontend/src/pages/DashboardPage.tsx": "Shows overall task metrics, revenue stats, upcoming and overdue tasks, with navigation into filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Displays and filters all tasks with search, sorting, bulk actions, editing, export, and upload capabilities.",
  "frontend/src/utils/assigneeCsv.ts": "Generates and parses CSV templates for assignee bulk upload with basic validation and row conversion.",
  "frontend/src/utils/clientCsv.ts": "Generates and parses client CSV upload templates, validating required fields and mapping rows to backend format.",
  "frontend/src/utils/taskAggregations.ts": "Provides utilities to compute task statistics, revenue by category, and status counts for analytics.",
  "frontend/src/utils/taskCsv.ts": "Parses and validates task CSV files, generates templates, and converts date/number fields while collecting errors. Includes CSV line parsing and optional-field handling for bulk task upload.",
  "frontend/src/utils/taskDisplay.ts": "Provides formatting helpers for task dates, currency, and optional text with a placeholder fallback. Ensures consistent display in UI components.",
  "frontend/src/utils/taskExcel.ts": "Converts tasks into Excel-friendly rows, loads SheetJS from CDN, and exports formatted task data to a downloadable .xlsx file. Handles date and currency formatting and column sizing.",
  "frontend/src/utils/taskSort.ts": "Implements sortable task lists with configurable fields and directions using safe comparisons for strings, numbers, and bigint timestamps. Includes labeling and status-display normalization.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage. Supports cleanup of sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending typography, colors, radius, shadows, animations, and container settings. Enables plugins and defines a custom theme for the app.",
  "project_state.json": "Metadata describing the project’s state, architecture notes, known issues, and implemented features. Used for tracking requirements and build planning."
}