{
  "backend/main.mo": "Main backend actor defining Client, Task, Assignee, and Todo types with CRUD operations, bulk operations, and multi-user storage using per-principal maps with access control via MixinAuthorization.",
  "backend/migration.mo": "Migration module defining OldActor type and a no-op run function that returns the old actor state unchanged for future upgrade compatibility.",
  "feature_evidence.json": "Feature evidence report documenting three features for expanding TaskBulkEditDialog with all editable fields, updating useBulkUpdateTasks mutation hook, and wiring form submission to mutation with proper UI flow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including pages, components, hooks, and utilities with details on authentication, CRUD operations, bulk actions, and UI patterns.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, destructive, borders, charts, and sidebar.",
  "frontend/index.html": "HTML entry point with CSWA favicon, viewport meta tag, page title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, authentication flow, profile setup modal, route definitions for dashboard/clients/tasks/assignees/todos, error boundary, and deferred URL cleanup hook.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV with template download, file parsing, validation error display, preview table, and submission using useBulkCreateAssignees mutation.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting assignees (teams) with form validation for name and captain fields. Includes confirmation dialog for deletion and manages form state with React hooks.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup. Prevents closing until name is submitted.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users displaying CSWA branding, sign-in button via Internet Identity, and feature cards highlighting client management, task tracking, and dashboard capabilities.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV file with template download, file parsing, validation error display, and preview table. Converts parsed rows to backend format before submission.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog component for creating, editing, and deleting individual clients with fields for name, GSTIN, PAN, and notes. Includes form validation and delete confirmation.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors and displays a fallback error screen instead of crashing the app.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error fallback UI displaying an error icon, message, and reload button when the application fails to start.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with responsive navigation sidebar/sheet, header with CSWA logo, and user profile dropdown menu with logout functionality. Includes navigation items for dashboard, clients, tasks, assignees, and todos.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Provides an inline editor for task comments with edit/save/cancel controls, using hover-to-reveal edit button and keyboard shortcuts (Enter to save, Escape to cancel).",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple tasks at once, allowing users to update common fields across selected tasks with an unchanged sentinel pattern to preserve unmodified values.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk uploading tasks via CSV file, with template download, file parsing, preview table, and sequential task creation (only imports clientName, taskCategory, and subCategory).",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Card component displaying comprehensive task details including client info, dates, financial data, payment status, and comments in a structured grid layout.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating or editing tasks with all task fields, handling status coercion, date formatting, and form state management with validation.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Dropdown component for quickly changing a task's status inline, updating the task with all existing fields preserved.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog for bulk uploading todos via CSV file with template download, file parsing, validation preview, and bulk creation using the useBulkCreateTodos hook.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog component for creating and editing todos with form fields for title, description, completed status, priority, and due date. Includes delete confirmation dialog and uses React Query mutations for CRUD operations.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses (Pending, Docs Pending, In Progress, Checking, Payment Pending, Completed, Hold) and provides utility functions for normalizing, validating, and mapping legacy status values.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for assignee CRUD operations including getAll, get, create, update, delete, and bulkCreate with optimistic updates and cache invalidation.",
  "frontend/src/hooks/clients.ts": "React Query hooks for client CRUD operations including getAll, get, create, update, delete, and bulkCreate with optimistic updates and cache invalidation.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for task CRUD operations including getAllTasksWithCaptain, get, create, and update with optimistic updates for task properties like status, assignee, dates, and payment details.",
  "frontend/src/hooks/todos.ts": "React Query hooks for todo CRUD operations including getAll, get, create, update, delete, and bulkCreate with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with admin tokens from URL parameters.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides React Query hooks for fetching and saving the current user's profile, with proper loading states and authentication checks.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "React hook that extracts secret parameters (like caffeineAdminToken) from URL hash, stores them in sessionStorage, and cleans up the URL after component mount to prevent router initialization issues.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm neutral color palette with sage green accents for both light and dark themes.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility functions for parsing and encoding client data; kept for backward compatibility but no longer needed as client data is now stored with explicit fields.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, bulk selection, bulk delete, and edit functionality, displaying assignees in a table with their captain information.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed information for a single client including GSTIN, PAN, notes, and associated tasks with statistics (total, completed, in progress, pending), with edit functionality.",
  "frontend/src/pages/ClientsPage.tsx": "Clients management page with search, filtering, bulk selection, bulk delete, and dialogs for creating/uploading clients. Displays clients in a table with checkboxes for multi-select operations.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard overview page displaying statistics (clients, tasks, assignees), revenue aggregations by category/subcategory, status breakdowns, and lists of upcoming/overdue tasks with navigation to filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Tasks management page with search, multi-filter (status, category, subcategory, overdue), sorting, bulk operations (edit, delete, export to Excel), inline editing, and task creation/upload dialogs. Supports URL-based filter initialization.",
  "frontend/src/pages/TodosPage.tsx": "Todos management page with search, completion filtering, bulk selection/deletion, and dialogs for creating/editing/uploading todos. Displays todos sorted by completion status and creation date.",
  "frontend/src/utils/assigneeCsv.ts": "CSV utilities for assignee bulk upload: generates/downloads template, parses CSV with validation (team name and captain required), and converts parsed rows to backend format.",
  "frontend/src/utils/clientCsv.ts": "CSV utilities for client bulk upload: generates/downloads template, parses CSV with validation (client name required), handles quoted fields, and converts parsed rows to backend format.",
  "frontend/src/utils/taskAggregations.ts": "Provides aggregation functions for task data including revenue by category/subcategory, status breakdowns, and comprehensive task statistics calculations.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV parsing and validation for bulk task uploads, including template generation, date/number parsing, and validation of required fields with support for quoted CSV values.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for task display including date formatting, currency formatting (INR), and placeholder handling for optional fields.",
  "frontend/src/utils/taskExcel.ts": "Exports tasks to Excel format by dynamically loading SheetJS library from CDN and converting task data to Excel-friendly format with formatted dates and currency.",
  "frontend/src/utils/taskSort.ts": "Implements sorting functionality for tasks across multiple fields (dates, status, category, client, assignee, bill) with ascending/descending direction and null-safe comparisons.",
  "frontend/src/utils/todoCsv.ts": "Handles CSV template generation, parsing, and validation for bulk todo uploads with support for title, description, completion status, priority, and due dates.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and parameter cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color palette using OKLCH, typography, container queries, animations (accordion), and extended theme with Inter/Georgia fonts and custom border radius/shadows.",
  "project_state.json": "Project state document (v53) for a tax consulting task/client management app, listing architectural notes (dashboard drill-down, task status constraints, router initialization issues), known issues (blank screens, edit dialog crashes, slow updates), and existing features."
}