{
  "backend/main.mo": "Main Motoko actor implementing a multi-tenant task management system with authorization, storing clients, tasks, assignees, and todos per-principal with CRUD operations and access control.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, and pages describing authentication, client/task management, dashboard, and error handling features.",
  "frontend/.ic-assets.json5": "Internet Computer asset configuration defining content types, cache policies, and security headers (CSP, X-Frame-Options) for static assets served by the frontend canister.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point with extensive diagnostic logging for asset loading, HTTP 503 error detection, canister identification, and network state tracking to debug service unavailability issues.",
  "frontend/src/App.tsx": "Root React application component configuring TanStack Router and React Query, handling authentication flow, profile setup modal, and comprehensive loading timeout diagnostics with HTTP 503 detection and asset canister health checks.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV file. Provides template download, file parsing with validation, preview table, and submission to backend using useBulkCreateAssignees hook.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting individual assignees. Manages form state for team name and captain fields with validation, using create/update/delete hooks.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that prompts new users to enter their name on first login. Non-dismissible dialog that calls useSaveCallerUserProfile hook on submission.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users displaying CSWA branding, sign-in button using Internet Identity, and feature cards describing client management, task tracking, and dashboard capabilities.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV. Includes template download, file parsing with validation errors display, preview table in scrollable area, and submission using useBulkCreateClients hook.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog for creating, editing, and deleting individual clients. Manages form fields (name, GSTIN, PAN, notes) with validation and uses create/update/delete client hooks.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors, logs detailed diagnostics, and renders a StartupErrorScreen with a reload handler that clears storage.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error screen UI component that displays categorized error details, troubleshooting steps, and provides actions to reload the app or copy error details to clipboard.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with sticky header, navigation sidebar (desktop/mobile), user profile dropdown, and logout functionality using Internet Identity.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editable comment field for tasks with edit/save/cancel controls, keyboard shortcuts (Enter/Escape), and mutation error handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple selected tasks with form fields for all task properties, using an unchanged sentinel pattern to only update modified fields.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk task creation via CSV upload with template download, file parsing, validation error display, and sequential task creation.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Displays detailed task information in a card layout, including client name, category, status badge, assigned team with captain, dates, financial amounts (bill, advance, outstanding), payment status, and optional comments.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating and editing tasks with fields for client, category, subcategory, status, dates, financial data, and assignments. Uses comboboxes populated from existing data and handles validation and submission via mutation hooks.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline status selector component that allows quick status updates for a task using a dropdown, handling null values with a sentinel and calling the update mutation on change.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog for bulk uploading todos via CSV file, providing template download, file parsing with validation preview, and batch creation using the bulk create mutation hook.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog form for creating, editing, and deleting individual todos with fields for title, description, completion status, priority, and due date, using mutation hooks for CRUD operations.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses as constants, provides normalization functions for legacy status mapping (To Do→Pending, Done→Completed, Blocked→Hold), validation helpers, and safe coercion for Select components.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for assignee CRUD operations including fetching all assignees, fetching single assignee by ID, creating, updating with optimistic updates, and deleting assignees with toast notifications.",
  "frontend/src/hooks/clients.ts": "Provides React Query hooks for managing client data (CRUD operations) with optimistic updates, cache invalidation, and toast notifications. Includes useClients, useClient, useCreateClient, useUpdateClient, and useDeleteClient hooks.",
  "frontend/src/hooks/tasks.ts": "Provides React Query hooks for task management including fetching all tasks with captain details, individual tasks, and CRUD operations. Includes extensive logging for debugging query performance and execution flow.",
  "frontend/src/hooks/todos.ts": "Provides React Query hooks for todo CRUD operations with optimistic updates and cache management. Includes useGetAllTodos, useGetTodo, useCreateTodo, useUpdateTodo, useDeleteTodo, and useBulkCreateTodos hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing it with Internet Identity when available and invalidating dependent queries when the actor changes. Handles both authenticated and anonymous actor creation.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks for fetching and saving the current user's profile (useGetCallerUserProfile and useSaveCallerUserProfile). Returns null instead of throwing errors to allow profile setup modal to display.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Extracts caffeineAdminToken from URL hash on mount, stores it in sessionStorage, and cleans the URL after a 100ms delay to prevent URL flash. Includes comprehensive logging for debugging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks with login/logout functionality, identity management, and status tracking. Creates AuthClient with configurable options and manages identity persistence across page reloads.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm neutral color palette with sage green primary colors for both light and dark modes.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility for parsing and encoding client data; now kept for backward compatibility as the Client model uses explicit fields without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, filtering, bulk operations (delete, export), and dialogs for creating/editing assignees and bulk uploads.",
  "frontend/src/pages/ClientDetailPage.tsx": "Detailed view page for a single client showing client information and associated tasks, with navigation between clients via a dropdown selector and edit capabilities.",
  "frontend/src/pages/ClientsPage.tsx": "Page component for managing clients with search functionality, bulk operations (delete, export), and dialogs for creating/editing clients and bulk uploads.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard overview page displaying summary metrics (total tasks, clients, revenue) and aggregated task data by category, subcategory, and status in tables.",
  "frontend/src/pages/TasksPage.tsx": "Comprehensive task management page with search, multi-field filtering, sorting, bulk operations, inline editing, and URL parameter support for deep linking to filtered views.",
  "frontend/src/pages/TodosPage.tsx": "Main todos page component with filtering, search, bulk selection/deletion, and CRUD operations using React Query hooks and shadcn/ui components.",
  "frontend/src/utils/assetLoadingDiagnostics.ts": "Comprehensive asset loading diagnostics utility that intercepts fetch and script errors, with special detection and logging for HTTP 503 errors and network failures.",
  "frontend/src/utils/assigneeCsv.ts": "CSV template generation, parsing, and validation utilities for bulk assignee uploads with team name and captain fields.",
  "frontend/src/utils/assigneeExcel.ts": "Excel export utility for assignees that dynamically loads SheetJS library and generates downloadable XLSX files.",
  "frontend/src/utils/clientCsv.ts": "CSV template generation, parsing, and validation utilities for bulk client uploads with name, GSTIN, PAN, and notes fields.",
  "frontend/src/utils/clientExcel.ts": "Excel export utility for clients that dynamically loads SheetJS library and generates downloadable XLSX files with client details.",
  "frontend/src/utils/taskAggregations.ts": "Task aggregation utilities that calculate revenue and counts by category, sub-category, status, and combined dimensions for analytics and reporting.",
  "frontend/src/utils/taskCsv.ts": "Provides CSV parsing and validation for bulk task uploads, including template generation, date/number parsing, and validation of required fields (Client Name, Task Category, Sub Category) plus optional fields like status, dates, and payment information.",
  "frontend/src/utils/taskDisplay.ts": "Shared utilities for consistent task data formatting including date conversion from nanosecond timestamps, currency formatting in INR, and assignee name display with optional captain information.",
  "frontend/src/utils/taskExcel.ts": "Handles Excel export of tasks by dynamically loading SheetJS library and converting task data (including optional captain names) into formatted Excel files with proper date and currency formatting.",
  "frontend/src/utils/taskSort.ts": "Implements sorting logic for task lists across multiple fields (dates, status, category, client, assignee, bill amount) with ascending/descending direction support and null-safe comparisons.",
  "frontend/src/utils/todoCsv.ts": "Provides CSV template generation, parsing, and validation for bulk todo uploads with support for title, description, completed status, priority, and due date fields.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, container queries, animations, and custom font families (Inter and Georgia).",
  "frontend/vite.config.ts": "Vite build configuration for React app with path aliases, dev server on port 3000, API proxy to localhost:4943, and optimized build settings.",
  "project_state.json": "Project state tracking file indicating a pending feature request (AR-1) to retry deployment of Version 42 to production after resolving a previous deployment error."
}