{
  "backend/main.mo": "Main actor implementing a multi-tenant task management system with clients, tasks, assignees, and todos stored per-principal, including CRUD operations, authorization via MixinAuthorization, and migration support.",
  "backend/migration.mo": "Migration module defining old and new actor state types (clients, tasks, assignees, todos, userProfiles) and a run function that currently performs a no-op migration by copying all fields unchanged.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "Aggregated summaries of frontend components including App.tsx with TanStack Router, auth screens, dashboard with metrics, client/task CRUD pages, React Query hooks with optimistic updates, and deprecated dataParser utilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements (background, foreground, primary, secondary, muted, destructive, borders, charts, sidebar).",
  "frontend/index.html": "HTML entry point with CSWA favicon, viewport meta tag, and script tag loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup for routes (dashboard, clients, tasks, assignees, todos), authentication checks, profile setup modal, loading states, and deferred URL cleanup hook.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV with template download, file parsing, validation error display, preview table, and submission using useBulkCreateAssignees hook.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting assignees (teams) with form validation for name and captain fields. Includes confirmation dialog for deletions and uses React Query mutations for backend operations.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup. Cannot be dismissed and submits the name to save the user profile.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA branding, Internet Identity sign-in button, and three feature cards highlighting client management, task tracking, and dashboard insights.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV file with template download, file parsing, validation error display, and preview table. Converts parsed rows to backend format and submits via bulk create mutation.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog component for creating, editing, and deleting clients with fields for name, GSTIN, PAN, and notes. Includes form validation and delete confirmation dialog.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors and displays a fallback error screen. Logs errors to console for debugging.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error fallback UI displaying an alert icon, error message, and reload button when the application fails to start.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sticky header, navigation sidebar (desktop) and mobile sheet menu, user avatar dropdown with logout, and navigation links for Dashboard, Clients, Tasks, Assignees, and Todos with active state highlighting.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editor component for task comments with edit/save/cancel controls, supporting keyboard shortcuts (Enter to save, Escape to cancel) and displaying validation errors.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple tasks, currently supporting status updates with an unchanged sentinel value to skip fields the user doesn't want to modify.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk uploading tasks via CSV file with template download, file parsing, validation preview table, and sequential task creation with success/error handling.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Card component displaying comprehensive task details including client info, status badge, assignment/dates, financial amounts, payment status, and comments in a structured grid layout.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating or editing tasks with all fields (client, category, status, dates, financials, comments), handling status coercion and form reset on open/close.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline dropdown component for quickly changing a task's status without opening the full edit dialog, preserving all other task fields during update.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog for bulk uploading todos via CSV with template generation, file parsing, validation preview showing valid/invalid counts, and bulk creation with success feedback.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "A dialog component for creating and editing todos with form fields for title, description, completion status, priority, and due date. Includes delete functionality with confirmation dialog and uses React Query mutations for CRUD operations.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses (Pending, Docs Pending, In Progress, Checking, Payment Pending, Completed, Hold) and provides utility functions for normalizing, validating, and mapping legacy status values to current ones.",
  "frontend/src/hooks/assignees.ts": "Custom React Query hooks for assignee CRUD operations including fetching all/single assignees, creating, updating, deleting, and bulk creating assignees with optimistic updates and cache invalidation.",
  "frontend/src/hooks/clients.ts": "Custom React Query hooks for client CRUD operations including fetching all/single clients, creating, updating, deleting, and bulk creating clients with optimistic updates and cache invalidation.",
  "frontend/src/hooks/tasks.ts": "Custom React Query hooks for task CRUD operations including fetching all tasks with captain info, single tasks, creating, updating tasks with multiple fields (status, dates, billing, assignment), and optimistic cache updates.",
  "frontend/src/hooks/todos.ts": "Custom React Query hooks for todo CRUD operations including fetching all/single todos, creating, updating, deleting, and bulk creating todos with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance using Internet Identity authentication, initializes access control with an admin token from URL params, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides React hooks for fetching and saving the current user's profile using the backend actor, with proper loading states and query invalidation on updates.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "React hook that extracts secret parameters (like caffeineAdminToken) from the URL hash, stores them in sessionStorage, and removes them from the URL after component mount to prevent router initialization issues.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm neutral color palette with sage green accents for both light and dark themes.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility functions for parsing and encoding client data; now obsolete as the Client model uses explicit fields without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, bulk selection/deletion, individual editing, and bulk upload functionality using a table view.",
  "frontend/src/pages/ClientDetailPage.tsx": "Page component displaying detailed client information including GSTIN, PAN, notes, and associated tasks with statistics, plus edit functionality.",
  "frontend/src/pages/ClientsPage.tsx": "Displays a searchable, filterable table of clients with bulk selection, deletion, and CSV upload capabilities. Includes a dialog for creating/editing individual clients and handles loading/error states.",
  "frontend/src/pages/DashboardPage.tsx": "Shows overview statistics (clients, tasks, assignees) with revenue aggregations by category/subcategory, status breakdowns, and lists of upcoming/overdue tasks. Provides navigation to filtered task views on click.",
  "frontend/src/pages/TasksPage.tsx": "Comprehensive task management page with search, filtering (status, category, subcategory, overdue), sorting, bulk operations (edit, delete, export to Excel), and inline comment editing. Supports URL-based filter initialization and task creation/editing dialogs.",
  "frontend/src/pages/TodosPage.tsx": "Manages a simple todo list with search, completion filtering, bulk selection/deletion, and CSV upload. Supports creating and editing individual todos with a dialog form.",
  "frontend/src/utils/assigneeCsv.ts": "Provides CSV template generation, download, parsing, and validation for bulk assignee uploads with fields for team name and captain.",
  "frontend/src/utils/clientCsv.ts": "Provides CSV template generation, download, parsing, and validation for bulk client uploads with fields for name, GSTIN, PAN, and notes.",
  "frontend/src/utils/taskAggregations.ts": "Provides functions to aggregate task data by category, sub-category, and status, calculating revenue totals, counts, and comprehensive task statistics for dashboard analytics.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV parsing and validation for bulk task uploads, including template generation, date/number parsing, and validation of required fields with support for quoted CSV values.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for displaying task data including dates, currency (INR), optional text fields, and assignee names with captain information.",
  "frontend/src/utils/taskExcel.ts": "Exports tasks to Excel format by dynamically loading SheetJS from CDN and converting task data to Excel-friendly format with formatted dates and currency values.",
  "frontend/src/utils/taskSort.ts": "Implements sorting functionality for tasks across multiple fields (dates, status, category, client, assignee, bill) with ascending/descending direction and null-safe comparisons.",
  "frontend/src/utils/todoCsv.ts": "Handles CSV template generation, parsing, and validation for bulk todo uploads with support for title, description, completion status, priority, and due dates.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and parameter cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, container queries, animations, and custom font families (Inter/Georgia).",
  "project_state.json": "Project state document for a tax consulting task/client management app, tracking architectural decisions, known issues (blank screens, task editing failures, slow updates), and existing features including Internet Identity authentication and dashboard drill-down."
}