{
  "backend/main.mo": "Motoko canister defining client, task, assignee, and user profile storage with access control and CRUD helpers.",
  "feature_evidence.json": "Feature evidence file listing new dashboard analytics, drilldown behavior, and inline comment editing with related source files.",
  "frontend-file-summaries.txt": "Aggregated summaries describing the purpose of each frontend file across pages, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens, dark mode variables, and global background/foreground styles.",
  "frontend/index.html": "HTML entry point loading the React app with favicon and root mount element.",
  "frontend/src/App.tsx": "Main app routing setup with authentication checks, profile setup gating, and defensive search‑param validation.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog enabling CSV-based bulk assignee upload with validation, preview, and mutation-based submission.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog form for creating, editing, and deleting assignees with validation and loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting users to enter their name and save their profile on first use.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing screen for signed‑out users with login button and feature highlights.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "CSV upload dialog that parses client rows, validates them, and submits bulk client creation.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog form for adding, editing, and deleting individual clients with field validation.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "Error boundary that catches startup errors and displays a fallback screen.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Fallback error screen prompting the user to reload the page.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, header, mobile menu, and user profile controls.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editor allowing users to view and update a task's comment with save/cancel controls and error handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple tasks, building an updates list based on provided field values and submitting via bulk update mutation.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for CSV-based bulk task creation, supporting template download, CSV parsing, validation display, and submitting parsed tasks to backend.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Read‑only task details panel displaying all task fields in a structured layout with formatted dates and currency.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Create/edit task dialog with a full form, handling field population, validation, and submission via create or update mutations.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Compact status selector that updates a task’s status directly through a mutation.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses and utilities for normalizing, validating, mapping legacy statuses, and preparing values for UI selects.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for fetching, creating, updating, and deleting assignees, including bulk operations and cache invalidation.",
  "frontend/src/hooks/clients.ts": "React Query hooks for CRUD and bulk operations on clients, managing queries via the actor and cache invalidation.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for retrieving, creating, updating, deleting, and bulk operations on tasks, wired to the actor with cache updates.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and update the authenticated user's profile using the actor and React Query.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Captures secret URL parameters, stores them in sessionStorage, and removes them from the URL on mount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login flow, and stored identity handling.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables for themes, colors, and base styling.",
  "frontend/src/lib/dataParser.ts": "Deprecated helpers for parsing and encoding legacy client data structures.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, Internet Identity provider, global styles, and renders the root app.",
  "frontend/src/pages/AssigneesPage.tsx": "Displays and manages assignees with search, selection, bulk deletion, and dialogs for create, edit, and bulk upload.",
  "frontend/src/pages/ClientDetailPage.tsx": "Shows detailed client info with task statistics, task list filtering, and dialogs for editing the client and adding tasks.",
  "frontend/src/pages/ClientsPage.tsx": "Lists clients with search, selection, bulk delete, and dialogs for adding or bulk-uploading clients.",
  "frontend/src/pages/DashboardPage.tsx": "Generates task-related metrics, upcoming and overdue task lists, and links to filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Provides full task management with filtering, sorting, bulk actions, editing, exporting, and quick status updates.",
  "frontend/src/utils/assigneeCsv.ts": "Handles CSV template generation and parsing for assignee bulk upload, including validation and backend mapping.",
  "frontend/src/utils/clientCsv.ts": "Provides CSV template generation, download, parsing, and validation utilities for bulk client upload.",
  "frontend/src/utils/taskAggregations.ts": "Aggregates tasks by category, subcategory, and status to produce revenue and count statistics.",
  "frontend/src/utils/taskCsv.ts": "Generates task CSV templates and parses CSV files into validated extended task inputs.",
  "frontend/src/utils/taskDisplay.ts": "Formats task dates, currency values, and optional text for UI display with placeholders.",
  "frontend/src/utils/taskExcel.ts": "Converts tasks to Excel format, loads SheetJS, and exports a styled Excel file for download.",
  "frontend/src/utils/taskSort.ts": "Sorts task lists by various fields using custom comparators for strings, numbers, and timestamps.",
  "frontend/src/utils/urlParams.ts": "Manages URL and session-stored parameters, supporting retrieval, persistence, and cleanup in hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app goals, architectural notes, known issues, and existing feature definitions for a task/client management app."
}