{
  "backend/main.mo": "Motoko canister defining clients, tasks, assignees, user profiles, and authorization‑protected CRUD operations using per‑caller Map storage.",
  "feature_evidence.json": "Report mapping features to affected frontend files, components, and test IDs with high‑confidence evidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files and their functionality across pages, components, and hooks.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining OKLCH‑based color tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App router setup with authentication gating, profile‑setup flow, and route definitions for all main pages.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "CSV‑based bulk assignee upload dialog handling parsing, validation, and submission via bulkCreateAssignees.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog form for creating, editing, and deleting assignees with validation and mutation hooks.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and save their profile.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing screen for signed‑out users with branding, feature highlights, and Internet Identity login.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for uploading a CSV of clients, validating rows, previewing data, and bulk‑creating clients.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog form for creating, editing, and deleting individual clients with validation and mutation hooks.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "Error boundary that catches startup errors and displays a fallback error screen.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Fallback UI shown on startup errors with a prompt to reload the page.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, mobile menu, user profile menu, and logout handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Bulk edit dialog allowing updates to multiple tasks with optional fields and submission via bulkUpdateTasks.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "CSV-based bulk task upload dialog handling template download, file parsing, validation, and batch creation.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Read‑only panel displaying all task fields with formatted dates, currency, and status labels.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Create/edit task form dialog managing full task input state and submitting via create or update mutations.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline status selector enabling quick task status updates through useUpdateTask.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses and utilities for normalizing, validating, and displaying status values.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for CRUD and bulk operations on assignees via the backend actor API.",
  "frontend/src/hooks/clients.ts": "React Query hooks for CRUD and bulk operations on clients using the actor API.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for fetching, creating, updating, deleting, and bulk operations on tasks via the actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for fetching and saving the current user's profile through the actor.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Empty placeholder file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and related status.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables for light and dark themes.",
  "frontend/src/lib/dataParser.ts": "Deprecated client parsing utilities kept for backward compatibility.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AssigneesPage.tsx": "UI page for listing, filtering, editing, and bulk-deleting assignees using related hooks.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed information for a single client, including their tasks, statistics, and edit/create dialogs, with loading and error states.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients with search, selection, bulk delete, and bulk upload features, plus dialogs for adding clients.",
  "frontend/src/pages/DashboardPage.tsx": "Shows task-based business metrics including counts, revenue stats, upcoming and overdue tasks, with navigation filters.",
  "frontend/src/pages/TasksPage.tsx": "Provides full task management with filtering, sorting, bulk actions, creation/editing, CSV upload, and export capabilities.",
  "frontend/src/utils/assigneeCsv.ts": "Generates and parses CSV files for assignee bulk upload, including validation and backend format conversion.",
  "frontend/src/utils/clientCsv.ts": "Handles CSV template generation, parsing, validation, and backend conversion for client bulk uploads.",
  "frontend/src/utils/taskAggregations.ts": "Computes task statistics including totals, revenue by category, and status breakdowns for dashboard use.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV template generation, parsing, and validation for bulk task upload, including date/number parsing and error collection.",
  "frontend/src/utils/taskDisplay.ts": "Provides formatting helpers for task dates, currency, and optional text with a consistent placeholder.",
  "frontend/src/utils/taskExcel.ts": "Converts tasks into Excel-friendly data and exports them using SheetJS, including date and currency formatting.",
  "frontend/src/utils/taskSort.ts": "Implements sorting logic for tasks across multiple fields using safe comparison helpers.",
  "frontend/src/utils/urlParams.ts": "Manages URL and sessionStorage parameters for routing and persistence, including retrieval and cleanup utilities.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend UI.",
  "project_state.json": "Stores project metadata, requirements, known issues, and architectural notes for the build."
}