{
  "backend/main.mo": "Motoko canister defining types and CRUD logic for clients, tasks, assignees, and user profiles with access control and per-caller storage maps.",
  "feature_evidence.json": "Feature evidence report describing added assignee-wise sorting and listing associated frontend files and components.",
  "frontend-file-summaries.txt": "Aggregated summaries of all major frontend files including pages, components, hooks, utilities, and styling.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, theming variables, and dark mode mappings.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication flow, profile setup gating, and main application routes.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog for CSV-based bulk assignee upload with template download, file parsing, validation, and mutation handling.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog for creating, editing, and deleting assignees with validation and CRUD mutations.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal capturing a user's name and saving it via a profile mutation.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Public landing screen with branding and a login button using Internet Identity.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for CSV-based bulk client upload with parsing, validation, and creation flow.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog for creating, editing, or deleting a single client with validation and form state handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout including navigation, mobile menu, user profile avatar, and logout handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog enabling bulk updates to multiple tasks with optional field changes.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for uploading a CSV, validating parsed tasks, and submitting them via bulkCreateTasks.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Read‑only task details viewer showing core fields, dates, and financial info using formatted helpers.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Create/edit task form dialog handling full task field input, state initialization, and submission via create/update hooks.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline status selector that updates a task’s status using updateTask.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses, legacy mappings, and helpers for normalizing, validating, and displaying statuses.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for CRUD and bulk operations on assignees using the backend actor.",
  "frontend/src/hooks/clients.ts": "React Query hooks for CRUD and bulk operations on clients using the backend actor.",
  "frontend/src/hooks/tasks.ts": "React-query hooks for CRUD and bulk operations on tasks using the backend actor, with automatic cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the caller's user profile through the backend actor with caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a context provider and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/src/lib/dataParser.ts": "Deprecated helpers for parsing and encoding client data for backward compatibility.",
  "frontend/src/main.tsx": "App entry point that mounts React with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AssigneesPage.tsx": "UI page for listing, searching, editing, and bulk-deleting assignees with dialogs and table controls.",
  "frontend/src/pages/ClientDetailPage.tsx": "Client detail view that loads client data, lists tasks for that client, and provides edit and task creation dialogs.",
  "frontend/src/pages/ClientsPage.tsx": "UI page to list, search, select, upload, and bulk-delete clients using table controls and dialogs.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing aggregated task metrics, upcoming and overdue tasks, with navigation filters.",
  "frontend/src/pages/TasksPage.tsx": "Full task management page with filtering, sorting, bulk actions, CSV upload, and task CRUD dialogs.",
  "frontend/src/utils/assigneeCsv.ts": "Generates and parses CSV files for assignee bulk upload with validation and backend formatting.",
  "frontend/src/utils/clientCsv.ts": "CSV utilities for client bulk upload including parsing, validation, template generation, and formatting.",
  "frontend/src/utils/taskAggregations.ts": "Provides functions to compute task statistics, revenue by category, and status breakdowns.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV template generation, parsing, and validation for bulk task upload including date and number conversion.",
  "frontend/src/utils/taskDisplay.ts": "Utility helpers for formatting task dates, currency, and optional text with a placeholder.",
  "frontend/src/utils/taskExcel.ts": "Converts tasks into Excel-friendly rows, loads SheetJS dynamically, and exports a formatted XLSX file.",
  "frontend/src/utils/taskSort.ts": "Provides sorting logic for tasks across multiple fields using safe comparison functions.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL and session parameters for routing and state retention.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theming, typography, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing app goals, architecture notes, features, and known issues."
}