{
  "backend/main.mo": "Actor canister managing clients, tasks, and user profiles with access control, per-caller storage maps, and CRUD APIs for the new Task model.",
  "backend/migration.mo": "Migration module converting old task structures to the new Task model by mapping fields and initializing new optional fields to null.",
  "feature_evidence.json": "Feature evidence report linking frontend files to implemented features such as bulk task upload, new task fields, and bulk editing.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose, including pages, dialogs, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, light/dark theme variables, and global element styling.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, root mounting div, and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and authentication gating, rendering app layout and profile setup when needed.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their display name via a profile creation form.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Displays a branded sign‑in page with a login button and feature highlights, using Internet Identity for authentication.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Provides a dialog for creating, editing, and deleting clients with form validation and hooks for backend mutations.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with navigation, mobile menu, user profile display, and logout handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Allows bulk editing of selected tasks by updating only the fields filled in and submitting a collective update request.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Handles CSV-based bulk task creation, including template download, file parsing, validation, and upload submission.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog component for creating, editing, and deleting tasks with full form state and validation logic.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Compact status selector that updates a task’s status via mutation.",
  "frontend/src/hooks/clients.ts": "React Query hooks for fetching, creating, updating, and deleting clients via the backend actor.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for CRUD and bulk operations on tasks using the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for retrieving and saving the current user's profile through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook managing login, logout, identity loading, and state.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light and dark theme palettes.",
  "frontend/src/lib/dataParser.ts": "Utility functions to parse and encode client data fields into structured objects.",
  "frontend/src/main.tsx": "Application entry point initializing React Query, Internet Identity, and rendering the app.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays a single client's details, loads their tasks, handles loading/error states, and provides edit and task creation dialogs.",
  "frontend/src/pages/ClientsPage.tsx": "Shows a searchable, filterable list of clients with add-client functionality and loading/error handling.",
  "frontend/src/pages/DashboardPage.tsx": "Renders dashboard stats for clients and tasks, computing counts like active clients and overdue tasks.",
  "frontend/src/pages/TasksPage.tsx": "Provides a searchable, filterable, sortable task list with bulk selection, editing, deleting, and upload tools.",
  "frontend/src/utils/taskCsv.ts": "Implements CSV template generation and parsing with validation for bulk task uploads.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for theming and container queries.",
  "project_state.json": "Stores the project’s state, versioning, feature list, and metadata for the task/client management app."
}