{
  "backend/main.mo": "Main Motoko actor implementing a multi-tenant task management system with clients, tasks, assignees, and todos, using role-based access control (MixinAuthorization) and data migration support.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types for data structure versioning; currently implements a no-op migration that passes through unchanged data.",
  "feature_evidence.json": "Feature evidence report documenting four features for optimistic updates, visual feedback, cache optimization, and success notifications in the bulk task update workflow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, pages, hooks, and utilities, describing authentication flows, CRUD operations, UI components, and data management patterns.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens for UI elements including sidebar, charts, and semantic colors.",
  "frontend/index.html": "HTML entry point for the React application with CSWA Group of Companies branding, favicon reference, and module script loader for main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for dashboard, clients, tasks, assignees, and todos, handling authentication state, profile setup modal, and URL cleanup with error boundaries.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV file, with template download, file parsing, validation error display, and submission to backend using useBulkCreateAssignees hook.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Form dialog for creating, editing, and deleting individual assignees with fields for team name and captain, using create/update/delete hooks and validation.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that prompts new users to enter their name on first login, using useSaveCallerUserProfile hook and preventing dismissal until completed.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users displaying CSWA branding, feature cards for client management/task tracking/dashboard, and Internet Identity sign-in button.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV with template download, file parsing, validation preview table, and submission using useBulkCreateClients hook.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Form dialog for creating, editing, and deleting individual clients with fields for name, GSTIN, PAN, and notes, including validation and delete confirmation.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors and renders StartupErrorScreen fallback UI.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error fallback screen displaying an error icon, message, and reload button when application startup fails.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component providing header, navigation sidebar, and user authentication UI with Internet Identity integration. Includes responsive mobile menu, navigation items (Dashboard, Clients, Tasks, Assignees, Todos), and user profile dropdown with logout functionality.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editor component for task comments with edit/save/cancel controls. Displays comment text with hover-to-edit button, switches to input field with keyboard shortcuts (Enter to save, Escape to cancel).",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple tasks simultaneously with all task fields (client, category, status, dates, payment info). Uses unchanged sentinel pattern to only update fields that user explicitly changes.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk task creation via CSV file upload with template download, file parsing, validation, and preview table. Creates tasks sequentially and shows upload progress with error handling.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Read-only card component displaying comprehensive task details including client info, dates, payment information, and comments. Shows assignee with captain name and formatted currency/date values.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating new tasks or editing existing ones with all task fields. Handles form state, validation, and submission with separate create/update mutations and error handling.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline dropdown component for quickly changing task status without opening full edit dialog. Updates task status while preserving all other task fields.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog component for bulk uploading todos via CSV file, with template download, file parsing, validation preview, and batch creation functionality.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog component for creating, editing, and deleting individual todos with form fields for title, description, completion status, priority, and due date.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses, provides normalization and validation utilities, and maps legacy status values (To Do, Done, Blocked) to new equivalents.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for CRUD operations on assignees, including optimistic updates, bulk creation, and query invalidation.",
  "frontend/src/hooks/clients.ts": "React Query hooks for CRUD operations on clients, including optimistic updates, bulk creation, and query invalidation.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for CRUD operations on tasks with captain information, including optimistic updates, partial updates, bulk operations, and comprehensive field management.",
  "frontend/src/hooks/todos.ts": "React Query hooks for CRUD operations on todos, including getAllTodos, getTodo, createTodo, updateTodo (with optimistic updates), deleteTodo, and bulkCreateTodos.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializes access control with admin token from URL params, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "React Query hooks for fetching and saving the current authenticated user's profile, with proper error handling and authentication checks.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "React hook that captures secret parameters (caffeineAdminToken) from URL hash, stores them in sessionStorage, and removes them from URL after component mount to prevent router initialization issues.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation identity support.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm neutral/sage green color palette for light and dark modes, including primary, secondary, accent, and chart colors.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility functions for parsing and encoding client data; now obsolete as Client model uses explicit fields without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, bulk selection/deletion, create/edit dialogs, and bulk upload functionality using shadcn/ui components and assignee hooks.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed information for a single client including GSTIN, PAN, and associated tasks with statistics (total, completed, in-progress, pending). Provides edit functionality and task filtering/viewing capabilities.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients in a searchable table with bulk selection, deletion, and upload features. Includes client creation dialog and navigation to individual client detail pages.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing aggregate statistics (clients, tasks, assignees), revenue breakdowns by category/subcategory, status distribution, and upcoming/overdue tasks. Provides navigation to filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Comprehensive task management page with search, filtering (status, category, subcategory, overdue), sorting, bulk operations (edit, delete, upload), Excel export, and inline editing for comments and status.",
  "frontend/src/pages/TodosPage.tsx": "Todo list management page with search, completion filtering, bulk operations (delete, upload), and CRUD dialogs. Sorts todos by completion status and creation date.",
  "frontend/src/utils/assigneeCsv.ts": "Utility functions for assignee CSV bulk upload including template generation/download, CSV parsing with quote handling, validation with error reporting, and conversion to backend format.",
  "frontend/src/utils/clientCsv.ts": "Provides CSV template generation, parsing, and validation utilities for bulk client uploads with fields like name, GSTIN, PAN, and notes.",
  "frontend/src/utils/taskAggregations.ts": "Aggregates task data by category, sub-category, and status to calculate revenue totals, counts, and comprehensive task statistics for reporting.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV template generation and parsing for bulk task uploads with extensive field support including dates, financial data, and validation.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for displaying task data including dates, currency, optional text, and assignee names with captain information.",
  "frontend/src/utils/taskExcel.ts": "Exports task data to Excel format by dynamically loading SheetJS library from CDN and converting tasks to spreadsheet-friendly format.",
  "frontend/src/utils/taskSort.ts": "Implements sorting logic for tasks across multiple fields (dates, status, category, assignee, bill) with ascending/descending direction support.",
  "frontend/src/utils/todoCsv.ts": "Provides CSV template generation, parsing, and validation for bulk todo uploads with fields like title, description, completion status, priority, and due date.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and methods to clear parameters from URLs without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and design tokens for a component library.",
  "project_state.json": "Project state document for a tax consulting task/client management app, tracking architectural decisions, known issues (blank screen/loading hangs, task edit failures, admin token URL handling), and existing features including Internet Identity authentication and task/client management."
}