{
  "backend/main.mo": "Main Motoko actor defining Client, Task, Assignee, and Todo types with CRUD operations, authorization mixin, persistent storage using Maps keyed by Principal, and auto-incrementing IDs for each entity.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: verifying frontend task update mutations send complete payloads including status for backend transition detection, and adding defensive date validation for completionDate timestamps in task display utilities.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files covering components, pages, hooks, and utilities with details on authentication, client/task/assignee/todo management, bulk operations, optimistic updates, and defensive error handling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point with CSWA favicon, viewport meta tag, page title 'CSWA Group of Companies - Client & Task Management', and script tag loading main.tsx module.",
  "frontend/src/App.tsx": "Root application component using TanStack Router with routes for dashboard, clients, tasks, assignees, and todos; handles authentication state, profile setup modal, loading states, and defensive search parameter validation for tasks route.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV file with template download, file parsing, validation error display, preview table, and submission using useBulkCreateAssignees hook with loading states and error handling.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting assignees (teams) with form validation for name and captain fields. Includes confirmation dialog for deletion and uses React Query mutations for backend operations.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup. Cannot be dismissed and submits the name to save the user profile.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA branding, Internet Identity sign-in button, and three feature cards highlighting client management, task tracking, and dashboard insights.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV file with template download, file parsing, validation error display, and preview table. Converts parsed rows to backend format and submits via bulk create mutation.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog component for creating, editing, and deleting clients with fields for name, GSTIN, PAN, and notes. Includes form validation and delete confirmation dialog.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors and displays a fallback error screen. Logs errors to console for debugging.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error fallback UI displaying an alert icon, error message, and reload button when the application fails to start.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sticky header, navigation sidebar (responsive mobile sheet), user avatar dropdown menu with logout, and navigation links for dashboard, clients, tasks, assignees, and todos with active state highlighting.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Provides an inline editor for task comments with edit/save/cancel controls, toggling between display and edit modes with keyboard shortcuts (Enter to save, Escape to cancel).",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog component for bulk editing multiple tasks at once, allowing users to update common fields (client, category, status, dates, payment info) across selected tasks with an unchanged sentinel pattern to preserve unmodified fields.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk uploading tasks via CSV file, providing template download, file parsing with validation, preview of parsed data with error display, and sequential task creation.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Card component displaying comprehensive task details including client info, dates, payment information, and comments in a structured grid layout with formatted values.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating or editing individual tasks with all task fields (client, category, status, dates, payment info, comments), using a sentinel value for null status handling.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Dropdown component for quickly changing a task's status inline, handling null status values with a sentinel and triggering full task updates on change.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog component for bulk uploading todos via CSV file, with template download, file parsing, validation preview, and batch creation functionality.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog component for creating, editing, and deleting individual todos with form fields for title, description, completion status, priority, and due date.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses, provides normalization functions for legacy status mapping, and includes validation and display utilities for task status values.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for CRUD operations on assignees, including optimistic updates, bulk creation, and query invalidation logic.",
  "frontend/src/hooks/clients.ts": "React Query hooks for CRUD operations on clients, including optimistic updates, bulk creation, and query invalidation logic.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for CRUD operations on tasks with optimistic updates, including specialized queries for tasks with captain information and partial task updates.",
  "frontend/src/hooks/todos.ts": "Provides React Query hooks for CRUD operations on todos (get all, get one, create, update, delete, bulk create) with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializes access control with admin token from URL params, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides React Query hooks to fetch and save the current authenticated user's profile, with proper error handling and authentication checks.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Hook that captures secret parameters (caffeineAdminToken) from URL hash, stores them in sessionStorage, and cleans up the URL after router initialization to prevent hangs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm neutral/sage green color palette for light and dark modes using OKLCH color space.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility functions for parsing and encoding client data; kept for backward compatibility but no longer needed as Client model now uses explicit fields.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the DOM.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, bulk selection/deletion, create/edit dialogs, and bulk upload functionality using table UI and React Query hooks.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed information for a single client including GSTIN, PAN, and associated tasks with statistics (total, completed, in-progress, pending). Provides edit functionality and task filtering/viewing capabilities.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients in a searchable table with bulk selection, deletion, and upload features. Includes client creation dialog and navigation to individual client detail pages.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing overview statistics (clients, tasks, assignees), revenue aggregations by category/subcategory, status breakdowns, and upcoming/overdue tasks. Provides navigation to filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Comprehensive task management page with search, filtering (status, category, subcategory, overdue), sorting, bulk operations (edit, delete, upload), Excel export, and inline editing capabilities. Supports URL-based filter initialization.",
  "frontend/src/pages/TodosPage.tsx": "Todo list management page with search, completion filtering, bulk operations (delete, upload), and CRUD functionality. Sorts todos by completion status and creation date.",
  "frontend/src/utils/assigneeCsv.ts": "Utility functions for assignee CSV bulk upload including template generation/download, CSV parsing with quote handling, validation, and conversion to backend format. Validates required fields (Team Name, Captain).",
  "frontend/src/utils/clientCsv.ts": "Provides CSV template generation, download, parsing, and validation utilities for bulk client uploads with fields like name, GSTIN, PAN, and notes.",
  "frontend/src/utils/taskAggregations.ts": "Aggregates task data by category, sub-category, status, and combinations to calculate revenue, counts, and comprehensive statistics for reporting and analytics.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV template generation, parsing, and validation for bulk task uploads with support for all task fields including dates, assignments, billing, and payment status.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for task display including date conversion from nanosecond timestamps, currency formatting, and placeholder handling.",
  "frontend/src/utils/taskExcel.ts": "Exports tasks to Excel format by dynamically loading SheetJS library from CDN and converting task data to formatted spreadsheet with all task fields.",
  "frontend/src/utils/taskSort.ts": "Implements multi-field sorting for tasks with ascending/descending directions, handling null values and supporting sorting by dates, status, categories, assignees, and billing amounts.",
  "frontend/src/utils/todoCsv.ts": "Manages CSV template generation, parsing, and validation for bulk todo uploads with fields like title, description, completion status, priority, and due dates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and design tokens for a component library.",
  "project_state.json": "Project state document for a tax consulting task/client management app, tracking architectural decisions, known issues (including router hangs, blank screens, and task edit failures), and existing features with Internet Identity authentication."
}