{
  "backend/main.mo": "Main backend actor implementing a multi-tenant task management system with clients, tasks, assignees, and todos. Includes role-based access control via MixinAuthorization, per-user data isolation using Principal-keyed maps, and migration support.",
  "backend/migration.mo": "Migration module defining OldState and NewState types for all data structures (clients, tasks, assignees, todos, user profiles). Currently implements a no-op migration that returns the old state unchanged.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: frontend-backend connection verification and authentication flow correctness, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend source files describing component functionality, state management patterns, authentication flows, error handling, and UI enhancements across the React application.",
  "frontend/.ic-assets.json5": "Asset configuration for Internet Computer frontend canister defining HTTP headers, caching policies, and Content Security Policy for various file types (JS, CSS, images, fonts, HTML).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements (background, foreground, primary, secondary, muted, accent, destructive, borders, charts, sidebar).",
  "frontend/index.html": "HTML entry point with extensive diagnostic logging for HTTP 503 errors and asset loading failures, tracking script load attempts, network conditions, canister information, and providing detailed error reporting for troubleshooting deployment issues.",
  "frontend/src/App.tsx": "Root React application component with TanStack Router, authentication flow using Internet Identity, 30-second timeout detection with comprehensive diagnostics, profile setup modal for new users, and error boundary with StartupErrorScreen for backend connection failures.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV file. Handles CSV template download, file parsing with validation, preview of parsed rows with error display, and submission to backend using the bulk create hook.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting individual assignees. Manages form state for team name and captain fields with validation, and includes a confirmation dialog for deletions.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name for profile setup. Prevents closing until the name is submitted using the save caller user profile hook.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA branding, feature highlights, and Internet Identity login button. Includes decorative gradient backgrounds and feature cards showcasing platform capabilities.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog component for bulk uploading clients via CSV file. Provides CSV template download, file parsing with validation, scrollable preview table of parsed rows with error indicators, and submission to backend.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog component for creating, editing, and deleting individual clients. Manages form fields for name, GSTIN, PAN, and notes with validation, and includes a confirmation dialog for deletions.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors, logs detailed diagnostics, and displays a recovery screen with an option to reload the app after clearing storage.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error display component that categorizes errors (backend, network, auth, navigation), shows troubleshooting steps, and provides actions to copy error details or reload the application.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with header, navigation menu (Dashboard, Clients, Tasks, Assignees, Todos), user profile dropdown, and logout functionality using Internet Identity.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editor component for task comments with edit/save/cancel controls, keyboard shortcuts (Enter to save, Escape to cancel), and error handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog component for bulk editing multiple tasks simultaneously, allowing updates to client, category, status, assignee, dates, and payment fields with an unchanged sentinel pattern.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog component for bulk task creation via CSV upload, with template download, file parsing, validation, preview table, and sequential task creation.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Displays detailed task information in a card layout, including client name, category, status, assignee, dates, financial details (bill, advance, outstanding), payment status, and optional comments.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog component for creating and editing tasks with form fields for client, category, subcategory, status, assignee, dates, and financial information; includes comboboxes populated from existing data and validation logic.",
  "frontend/src/components/tasks/TaskListSkeleton.tsx": "Renders a loading skeleton for the task list table with animated placeholder rows showing all task columns including optional checkbox columns.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Provides a dropdown select component for quickly updating a task's status inline, using the updateTask mutation and handling null status values with a sentinel.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog for bulk uploading todos via CSV file with template download, file parsing, validation preview table, and bulk creation using the bulkCreateTodos mutation.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog component for creating, editing, and deleting todos with fields for title, description, completed status, priority, and due date; includes confirmation dialog for deletion.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses, provides normalization functions for legacy status values (To Do→Pending, Done→Completed, Blocked→Hold), and includes validation and display utilities for status handling.",
  "frontend/src/hooks/assignees.ts": "Provides React Query hooks for CRUD operations on assignees (useAssignees, useAssignee, useCreateAssignee, useUpdateAssignee, useDeleteAssignee) with optimistic updates, toast notifications, and cache invalidation.",
  "frontend/src/hooks/clients.ts": "Provides React Query hooks for CRUD operations on clients (useClients, useClient, useCreateClient, useUpdateClient, useDeleteClient) with optimistic updates, toast notifications, and cache invalidation.",
  "frontend/src/hooks/tasks.ts": "Provides React Query hooks for fetching tasks with captain information (useGetAllTasks, useTasksWithCaptain) and a pagination utility hook (usePaginatedTasks) with extensive logging and performance tracking.",
  "frontend/src/hooks/todos.ts": "Provides React Query hooks for CRUD operations on todos (useGetAllTodos, useGetTodo, useCreateTodo, useUpdateTodo, useDeleteTodo, useBulkCreateTodos) with optimistic updates and cache management.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current user's profile (useGetCallerUserProfile, useSaveCallerUserProfile) with careful loading state management to prevent UI flashing during authentication.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Extracts caffeineAdminToken from URL hash on mount, stores it in sessionStorage, and removes it from the URL after a short delay to prevent visible URL modification.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a modern color palette (deep teal, coral, purple) for both light and dark modes using CSS custom properties.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility file for parsing and encoding client data; now obsolete as the Client model uses explicit fields without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, bulk selection/deletion, Excel export, and dialogs for creating/editing assignees and bulk uploads.",
  "frontend/src/pages/ClientDetailPage.tsx": "Detail page for individual clients with client selector dropdown, edit functionality, and display of associated tasks using TaskDetailsPanel component.",
  "frontend/src/pages/ClientsPage.tsx": "Page component for managing clients with search filtering, bulk selection/deletion, Excel export, and dialogs for creating/editing clients and bulk uploads.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page component that displays summary metrics (total tasks, clients, revenue, pending tasks) and aggregated task data by category, subcategory, and status using cards, tables, and badges with modern gradient styling.",
  "frontend/src/pages/TasksPage.tsx": "Main tasks page with comprehensive filtering, sorting, search, bulk operations (edit, delete, upload), inline editing, pagination, and Excel export functionality. Includes URL parameter support for pre-filtering and enhanced query state logging.",
  "frontend/src/pages/TodosPage.tsx": "Todos page component with search, completion filtering, bulk selection/deletion, and CRUD operations via dialogs. Displays todos in a sortable table with active items prioritized over completed ones.",
  "frontend/src/utils/assetLoadingDiagnostics.ts": "Comprehensive diagnostics utility that intercepts and logs asset loading errors, with special tracking for HTTP 503 errors and actor initialization failures. Provides detailed diagnostic reports including network timing, headers, and environment information.",
  "frontend/src/utils/assigneeCsv.ts": "CSV utilities for assignee bulk upload: generates/downloads templates, parses CSV files with quote-aware parsing, validates required fields (name, captain), and converts rows to backend format.",
  "frontend/src/utils/assigneeExcel.ts": "Excel export utility for assignees that dynamically loads SheetJS library and exports assignee data (team name, captain) to downloadable XLSX files with timestamped filenames.",
  "frontend/src/utils/clientCsv.ts": "CSV utilities for client bulk upload: generates/downloads templates, parses CSV files with validation for required client name field, and handles optional fields (GSTIN, PAN, notes) with conversion to backend format.",
  "frontend/src/utils/clientExcel.ts": "Dynamically loads SheetJS library and exports client data (name, GSTIN, PAN, notes) to an Excel file with date-stamped filename.",
  "frontend/src/utils/taskAggregations.ts": "Provides aggregation functions for tasks by category, sub-category, status, and combined dimensions, calculating revenue totals and counts for analytics and reporting.",
  "frontend/src/utils/taskCsv.ts": "Parses and validates CSV files for bulk task upload with support for all task fields including dates, financial data, and status; generates CSV templates and handles quoted fields.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for task display including date conversion from nanosecond timestamps, currency formatting in INR, and assignee name formatting with captain information.",
  "frontend/src/utils/taskExcel.ts": "Dynamically loads SheetJS and exports task data with all fields (including captain names and formatted dates) to Excel files with date-stamped filenames.",
  "frontend/src/utils/taskSort.ts": "Implements multi-field sorting for tasks with ascending/descending direction support, handling null/undefined values and providing type-safe comparisons for strings, numbers, and bigint timestamps.",
  "frontend/src/utils/todoCsv.ts": "Generates CSV templates for todo bulk upload, parses CSV files with quote handling, validates todo rows, and converts parsed data to PartialTodoInput format.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, font families, border radius variables, custom shadows, and keyframe animations.",
  "frontend/vite.config.ts": "Vite configuration for React app with path aliases, dev server on port 3000, API proxy to localhost:4943, and build optimizations.",
  "project_state.json": "Project state tracking deployment verification features and a pending action request to fix backend canister connection issues from Version 48."
}