{
  "backend/main.mo": "Main Motoko actor implementing a multi-tenant CRM system with client, task, assignee, and todo management, using per-principal data isolation and role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no documented features.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, and pages describing authentication flows, CRUD operations, UI components, error handling, and React Query integration.",
  "frontend/.ic-assets.json5": "Asset canister configuration defining HTTP headers, caching policies (31536000s for static assets, no-cache for HTML), content types, and security headers including CSP for all frontend resources.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements using OKLCH color space.",
  "frontend/index.html": "Main HTML entry point with extensive diagnostic logging for asset loading failures, HTTP 503 error detection, network state tracking, and canister information extraction to aid debugging deployment issues.",
  "frontend/src/App.tsx": "Root React application component configuring TanStack Router and React Query, managing authentication flow, profile setup modal, and implementing 30-second loading timeout with comprehensive diagnostic reporting including HTTP 503 detection from asset diagnostics.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV file. Provides template download, file parsing with validation, preview table, and submission to backend using useBulkCreateAssignees hook.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting individual assignees. Handles form validation for team name and captain fields, with support for both controlled and uncontrolled open state.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that prompts new users to enter their name on first login. Non-dismissible dialog that saves profile using useSaveCallerUserProfile hook.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA branding, Internet Identity sign-in button, and three feature cards describing client management, task tracking, and dashboard capabilities.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV with template download, file parsing, validation error display, and preview table. Uses useBulkCreateClients hook and shows success state before auto-closing.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Form dialog for creating, editing, and deleting individual clients with fields for name, GSTIN, PAN, and notes. Includes validation, delete confirmation dialog, and supports both controlled and uncontrolled open state.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors, logs detailed diagnostics, and renders a StartupErrorScreen with a reload handler that clears storage.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error screen UI component that displays categorized error details, troubleshooting steps, and provides actions to reload the app, copy error details, or report issues.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with sticky header, responsive navigation (desktop sidebar and mobile sheet), user profile dropdown, and logout functionality.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editable comment field for tasks with edit/save/cancel controls, keyboard shortcuts (Enter/Escape), and mutation error handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple tasks with form fields for all task properties, using an unchanged sentinel pattern to only update explicitly modified fields.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk task creation via CSV upload with template download, file parsing, validation error display, and sequential task creation with progress feedback.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Displays detailed task information in a card layout, including client name, category, status badge, assigned team with captain, dates, financial amounts (bill, advance, outstanding), payment status, and optional comments.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating and editing tasks with comboboxes for client, category, subcategory, status, and assignee selection; includes date pickers, financial fields, and validation with loading states.",
  "frontend/src/components/tasks/TaskListSkeleton.tsx": "Renders an animated skeleton placeholder table for task lists with configurable row count and optional checkbox columns during data loading.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Provides a dropdown select component for quickly updating a task's status inline, handling null values with a sentinel and triggering task updates via mutation hook.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog for bulk uploading todos via CSV file with template download, file parsing, validation preview table showing valid/invalid rows, and batch creation functionality.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog form for creating, editing, and deleting todos with fields for title, description, completion status, priority, due date, and a confirmation dialog for deletion.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses as constants, provides normalization functions for legacy status mapping (To Do→Pending, Done→Completed, Blocked→Hold), validation, and safe coercion for Select components.",
  "frontend/src/hooks/assignees.ts": "Provides React Query hooks for CRUD operations on assignees, including fetching all assignees, fetching individual assignees, creating, updating (with optimistic updates), and deleting assignees with toast notifications.",
  "frontend/src/hooks/clients.ts": "Provides React Query hooks for CRUD operations on clients, including fetching all clients, fetching individual clients, creating, updating (with optimistic updates), and deleting clients with toast notifications.",
  "frontend/src/hooks/tasks.ts": "Provides React Query hooks for fetching tasks with captain information, includes pagination utilities (usePaginatedTasks) with page navigation, and extensive logging for debugging query performance and lifecycle.",
  "frontend/src/hooks/todos.ts": "Provides React Query hooks for CRUD operations on todos, including fetching all todos, fetching individual todos, creating, updating (with optimistic updates), deleting, and bulk creating todos.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, initializes access control with admin token from URL params, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current user's profile, with proper loading state management that accounts for authentication and actor initialization, returning null on error to allow profile setup.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Extracts caffeineAdminToken from URL hash on mount, stores it in sessionStorage, and cleans the URL after a 100ms delay to prevent URL flash while preserving the token for authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a warm neutral/sage green color palette, supporting both light and dark modes with OKLCH color space values.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility for parsing and encoding client data; now obsolete as Client model uses explicit fields without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, bulk selection/deletion, Excel export, and dialogs for creating/editing assignees and bulk uploads.",
  "frontend/src/pages/ClientDetailPage.tsx": "Detail view for a single client showing client information, associated tasks, with client selector dropdown and edit functionality.",
  "frontend/src/pages/ClientsPage.tsx": "Page component for managing clients with search filtering, bulk selection/deletion, Excel export, and dialogs for creating/editing clients and bulk uploads.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying summary metrics (tasks, clients, revenue) and aggregated task data by category, subcategory, and status with navigation to detail views.",
  "frontend/src/pages/TasksPage.tsx": "Main tasks management page with filtering, sorting, pagination, bulk operations (edit/delete/upload), Excel export, and inline editing capabilities. Includes comprehensive query state logging and URL parameter synchronization for filters.",
  "frontend/src/pages/TodosPage.tsx": "Todos management page with search, completion filtering, bulk selection/deletion, and CRUD operations via dialogs. Displays todos in a sortable table with active items prioritized.",
  "frontend/src/utils/assetLoadingDiagnostics.ts": "Comprehensive asset loading diagnostics utility that intercepts fetch requests and error events to detect and categorize failures (especially HTTP 503 errors), collecting detailed timing, headers, and environment information for debugging.",
  "frontend/src/utils/assigneeCsv.ts": "CSV template generation, parsing, and validation utilities for bulk assignee uploads with fields for team name and captain.",
  "frontend/src/utils/assigneeExcel.ts": "Dynamically loads SheetJS library and exports assignee data (name, captain) to Excel format with timestamped filenames.",
  "frontend/src/utils/clientCsv.ts": "CSV template generation, parsing, and validation utilities for bulk client uploads with fields for name, GSTIN, PAN, and notes.",
  "frontend/src/utils/clientExcel.ts": "Dynamically loads SheetJS library and exports client data (name, GSTIN, PAN, notes) to Excel format with timestamped filenames.",
  "frontend/src/utils/taskAggregations.ts": "Provides aggregation functions for tasks by category, sub-category, status, and combined dimensions, calculating revenue totals and counts. Exports interfaces for aggregated data structures and a comprehensive calculateTaskStats function.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV parsing and validation for bulk task uploads with support for all task fields including dates, financial data, and assignments. Includes CSV template generation and proper handling of quoted fields and date/number parsing.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for task display including date formatting (nanosecond timestamps to readable dates), currency formatting (INR), and assignee name formatting with captain information.",
  "frontend/src/utils/taskExcel.ts": "Exports tasks to Excel format by dynamically loading SheetJS library and converting task data with all fields including captain names and formatted dates to XLSX files.",
  "frontend/src/utils/taskSort.ts": "Implements flexible task sorting by multiple fields (dates, status, categories, financial amounts) with ascending/descending direction, safely handling null/undefined values by pushing them to the end.",
  "frontend/src/utils/todoCsv.ts": "Handles CSV parsing, validation, and template generation for bulk todo uploads with support for title, description, completion status, priority, and due dates. Includes proper quote handling and conversion to backend input format.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, container queries, animations, and design tokens for a component library.",
  "frontend/vite.config.ts": "Vite build configuration for a React app with path aliases, dev server on port 3000, API proxy to localhost:4943, and optimized build settings.",
  "project_state.json": "Project metadata file tracking schema version, architectural notes, issues, and features for a project named 'Retry deployment'."
}