{
  "backend/main.mo": "Motoko canister managing clients, tasks, assignees, and user profiles with access‑controlled CRUD operations and per‑caller storage maps.",
  "feature_evidence.json": "Feature evidence report documenting a URL token‑cleanup requirement linked to specific source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, dark mode variables, and global layout rules.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, root mount node, and script loader for the React app.",
  "frontend/src/App.tsx": "Main React router setup with authentication checks, deferred URL cleanup, profile‑setup gating, and route definitions for all pages.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog for bulk assignee uploads supporting CSV parsing, validation, error display, and submission via React Query.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog form for creating, editing, or deleting assignees with validation and mutation hooks.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their display name.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing screen for signed‑out users with branding, feature highlights, and login button.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for uploading a CSV, validating rows, and bulk‑creating clients through a mutation.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog form to create, update, or delete a client with validation and various fields.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "Error boundary that catches startup errors and displays a fallback screen.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Fallback screen showing an error message with an option to reload the page.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, user menu, mobile drawer, and logout handling.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Provides an inline UI to view and edit a task's comment with save and cancel actions using a mutation hook.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk‑editing multiple tasks, collecting optional field updates and submitting them via a bulk update mutation.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog that imports tasks from a CSV file, validates them, previews results, and submits them for bulk creation.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Read‑only display panel showing all task details with formatted status, dates, text, and amounts.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog for creating or editing a single task with full form fields and create/update mutations.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Compact status selector that updates a task's status using the update mutation hook.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses and helpers for normalizing, validating, and displaying task status values.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for CRUD and bulk operations on assignees using the actor API, with cache invalidation.",
  "frontend/src/hooks/clients.ts": "React Query hooks for fetching, creating, updating, deleting, and bulk operations on clients with actor-based calls.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for task retrieval and full CRUD plus bulk operations, calling actor methods and invalidating task caches.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches the backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and save the authenticated user's profile through the actor with proper loading and cache handling.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Reads secret params from the URL, stores them in session storage, and removes them from the URL after mount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity login, stored identity loading, and auth state.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark theme variables and global UI color tokens.",
  "frontend/src/lib/dataParser.ts": "Deprecated client parsing helpers kept for compatibility, mapping old encoded client formats to explicit fields.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and mounting the app.",
  "frontend/src/pages/AssigneesPage.tsx": "Page for listing, searching, editing, bulk uploading, and bulk deleting assignees with selection handling.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays a single client's details, related tasks, and stats with edit and task creation dialogs.",
  "frontend/src/pages/ClientsPage.tsx": "Lists clients with search, selection, bulk delete, and bulk upload, plus navigation to client details.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing task statistics, upcoming and overdue tasks, with navigation to filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Task management page with filtering, sorting, search, bulk actions, editing, and CSV import/export.",
  "frontend/src/utils/assigneeCsv.ts": "Utilities for generating, downloading, parsing, and validating CSV files for assignee bulk upload.",
  "frontend/src/utils/clientCsv.ts": "Generates CSV templates and parses client CSV files with basic validation.",
  "frontend/src/utils/taskAggregations.ts": "Provides aggregation utilities for tasks by category, subcategory, status, and revenue.",
  "frontend/src/utils/taskCsv.ts": "Builds task CSV templates and parses task CSV files into validated ExtendedTaskInput objects.",
  "frontend/src/utils/taskDisplay.ts": "Formats task dates, currency values, and optional text for UI display.",
  "frontend/src/utils/taskExcel.ts": "Converts tasks to Excel format and exports them using the SheetJS library.",
  "frontend/src/utils/taskSort.ts": "Sorts tasks by various fields with null-safe comparison helpers.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session-scoped parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, OKLCH color tokens, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state metadata, architectural notes, known issues, and existing feature requirements for a task/client management app."
}