{
  "backend/main.mo": "Motoko actor implementing client, task, assignee, and user‑profile storage with access‑controlled CRUD helpers and per‑caller maps.",
  "feature_evidence.json": "Feature‑evidence report listing three tested frontend features tied to urlParams.ts and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files covering routing, pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles with OKLCH color tokens for light and dark themes and global CSS variables.",
  "frontend/index.html": "Base HTML document setting favicon, title, viewport, and mounting the React entry script.",
  "frontend/src/App.tsx": "Main React router setup with authentication gating, URL cleanup hook, profile loading, and route definitions.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog for uploading assignees via CSV with parsing, validation, error handling, and bulk‑create mutation.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Modal form to create, update, or delete an assignee with validation and API mutations.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Always-open modal prompting the user to enter and save their name during initial profile setup.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Public landing screen showing branding and a sign-in button using Internet Identity.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for CSV-based bulk client upload with template download, parsing, validation, and submission.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Form dialog for creating or editing a client with field validation and delete support.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "Error boundary that catches startup errors and displays a fallback screen.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "UI screen shown on startup failure with messaging and a reload button.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, mobile sidebar, user menu, and logout handling.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editor for task comments with edit, cancel, and save actions using updateTaskComment.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for applying bulk updates to multiple tasks with conditional field updates and status handling.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog to upload tasks via CSV, showing parsed results, validation errors, and submitting valid tasks for creation.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Read‑only panel displaying all task details including status, dates, billing, and optional fields.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Form dialog for creating or editing a task with full field set, validation, and status handling.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Quick‑change dropdown for updating a task’s status directly via updateTask.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses and helpers for validating, normalizing, coercing, and labeling statuses.",
  "frontend/src/hooks/assignees.ts": "Provides React Query hooks for CRUD and bulk operations on assignees via the actor API, with automatic cache invalidation.",
  "frontend/src/hooks/clients.ts": "Implements React Query hooks for fetching, creating, updating, deleting, and bulk operations on clients through the actor.",
  "frontend/src/hooks/tasks.ts": "Defines React Query hooks for task retrieval and mutations, including detailed update logic and bulk operations with cache refresh.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and saves the caller’s user profile using the actor, with authentication-aware query enabling.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Extracts secret URL parameters into session storage and clears them from the URL after mount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including identity loading, login, logout, and status management.",
  "frontend/src/index.css": "Defines Tailwind layers and a custom light/dark theme using CSS variables for UI colors and styling.",
  "frontend/src/lib/dataParser.ts": "Deprecated utilities for parsing and encoding legacy client data formats, kept for compatibility.",
  "frontend/src/main.tsx": "Bootstraps the app, setting up React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/AssigneesPage.tsx": "UI page for listing, searching, selecting, editing, bulk uploading, and bulk deleting assignees.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays client details, related tasks, stats, and provides dialogs for editing clients and adding tasks.",
  "frontend/src/pages/ClientsPage.tsx": "Lists clients with search, selection, bulk upload, and bulk delete, plus navigation to detail pages.",
  "frontend/src/pages/DashboardPage.tsx": "Shows task statistics, upcoming and overdue tasks, and links to filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Full task management page with filters, sorting, bulk operations, exports, and task editing dialogs.",
  "frontend/src/utils/assigneeCsv.ts": "Generates and downloads CSV templates, parses CSV content, validates rows, and converts data for backend use.",
  "frontend/src/utils/clientCsv.ts": "Provides CSV template generation, downloading, and parsing for bulk client upload with validation of required fields.",
  "frontend/src/utils/taskAggregations.ts": "Aggregates task data by category, subcategory, status, and combinations to compute counts and revenue summaries.",
  "frontend/src/utils/taskCsv.ts": "Generates task CSV templates and parses task CSV files into structured objects with validation for required fields and types.",
  "frontend/src/utils/taskDisplay.ts": "Formats task dates, currency, and optional text fields with consistent placeholders for display.",
  "frontend/src/utils/taskExcel.ts": "Converts tasks to Excel-friendly rows, loads SheetJS, and exports data to a downloadable XLSX file.",
  "frontend/src/utils/taskSort.ts": "Sorts tasks by various fields using safe comparison logic for numbers, strings, and timestamps.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL and session parameters for routing and state management.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme settings (colors, fonts, animations), and typography/container/animate plugins.",
  "project_state.json": "Defines project state, architectural notes, known issues, and existing features for a task/client management app."
}