{
  "backend/main.mo": "Main Motoko actor implementing a multi-tenant task management system with clients, tasks, assignees, and todos, using role-based access control and per-principal data isolation.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features related to investigating and fixing task loading issues and adding error logging/diagnostics to the Tasks page component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend source files describing components, pages, hooks, and their functionality including authentication, task management, client management, error handling, and diagnostics.",
  "frontend/.ic-assets.json5": "Asset configuration for the Internet Computer frontend canister defining content types, caching policies, and security headers (CSP, X-Frame-Options) for various file types.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "Main HTML entry point with enhanced diagnostic logging for asset loading, HTTP 503 error detection, canister identification, and comprehensive error tracking for debugging loading issues.",
  "frontend/src/App.tsx": "Root React application component with TanStack Router, authentication flow, profile setup modal, 30-second loading timeout detection with comprehensive diagnostics including HTTP 503 detection, and React Query setup.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV file. Provides template download, file parsing with validation, preview table, and submission to backend using useBulkCreateAssignees hook.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Form dialog for creating, editing, and deleting individual assignees with fields for team name and captain. Includes validation, loading states, and delete confirmation dialog.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that prompts new users to enter their name on first login. Non-dismissible dialog that saves profile using useSaveCallerUserProfile hook.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA logo, sign-in button with Internet Identity, and three feature cards describing client management, task tracking, and dashboard capabilities.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV with template download, file parsing, validation error display, preview table, and submission using useBulkCreateClients hook.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Form dialog for creating, editing, and deleting individual clients with fields for name, GSTIN, PAN, and notes. Includes validation, loading states, and delete confirmation.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors, logs detailed diagnostics, and displays a recovery screen. Clears storage and reloads the app on recovery.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error screen UI component that displays categorized error details with troubleshooting steps, stack traces in dev mode, and actions to copy error details or reload the application.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with sticky header, responsive navigation sidebar, mobile menu sheet, and user profile dropdown with logout functionality.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editable comment field for tasks with edit/save/cancel controls, keyboard shortcuts (Enter/Escape), and mutation error handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple selected tasks with form fields for all task properties, using an unchanged sentinel pattern to only update modified fields.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk task creation via CSV upload with template download, file parsing, validation error display, and sequential task creation with progress feedback.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Displays detailed task information in a card layout, including client name, category, status badge, assigned team with captain, dates, financial amounts (bill, advance, outstanding), payment status, and optional comments.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating and editing tasks with fields for client, category, subcategory, status, assignee, dates, and financial data. Uses comboboxes populated from existing tasks/clients/assignees and handles validation and submission via mutation hooks.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Provides a dropdown select component for quickly updating a task's status inline, using the updateTask mutation and handling null status values with a sentinel.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog for bulk uploading todos via CSV file, with template download, file parsing, validation preview table showing valid/invalid rows, and submission using the bulkCreateTodos mutation.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog form for creating, editing, and deleting individual todos with fields for title, description, completed checkbox, priority, and due date. Includes a confirmation dialog for deletion.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses as a constant array, provides legacy status mapping (To Do→Pending, Done→Completed, Blocked→Hold), and exports utility functions for normalizing, validating, and coercing status values for UI components.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for assignee CRUD operations including fetching all assignees (authenticated and public), fetching single assignee, creating, updating, and deleting assignees with optimistic updates and toast notifications.",
  "frontend/src/hooks/clients.ts": "React Query hooks for managing client data including fetching all clients (authenticated and public), fetching individual clients, creating, updating, and deleting clients with optimistic updates and toast notifications.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for task management with extensive logging, including fetching tasks with captain information, public tasks, individual tasks, and mutations for creating, updating, and deleting tasks with optimistic UI updates.",
  "frontend/src/hooks/todos.ts": "React Query hooks for todo CRUD operations including fetching all todos, individual todos, creating, updating, deleting, and bulk creating todos with optimistic updates and query invalidation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializes access control with admin token from URL params, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "React Query hooks for fetching and saving the current user's profile, with proper loading state management that accounts for authentication and actor initialization states.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Hook that extracts caffeineAdminToken from URL hash on mount, stores it in sessionStorage, and cleans the URL after a 100ms delay to prevent URL flash.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for idle handling and identity provider.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm neutral color palette with sage green primary colors for both light and dark modes.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility for parsing and encoding client data; kept for backward compatibility but no longer needed since Client model now uses explicit fields without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, bulk operations (delete, export), and dialogs for creating/editing assignees and bulk uploads. Supports both authenticated and public views.",
  "frontend/src/pages/ClientDetailPage.tsx": "Detail page for viewing a single client with client selector dropdown, edit functionality, and associated tasks list with expandable task details panel.",
  "frontend/src/pages/ClientsPage.tsx": "Page component for managing clients with search, bulk operations (delete, export), and dialogs for creating/editing clients and bulk uploads. Supports both authenticated and public views.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard overview page displaying summary metrics (total tasks, clients, revenue, pending tasks) and aggregated task data by category, subcategory, status, and combined views in tables.",
  "frontend/src/pages/TasksPage.tsx": "Comprehensive tasks management page with search, filtering by client/category/status, sorting, bulk operations (delete, edit, export), inline editing, and extensive query state logging for debugging. Supports both authenticated and public views.",
  "frontend/src/pages/TodosPage.tsx": "Main todos page component with filtering, search, bulk selection/deletion, and CRUD operations using React hooks and shadcn/ui components.",
  "frontend/src/utils/assetLoadingDiagnostics.ts": "Comprehensive asset loading diagnostics utility that intercepts fetch/script errors, with special HTTP 503 detection and detailed error reporting for canister asset serving issues.",
  "frontend/src/utils/assigneeCsv.ts": "CSV template generation, parsing, and validation utilities for bulk assignee uploads with team name and captain fields.",
  "frontend/src/utils/assigneeExcel.ts": "Excel export utility for assignees that dynamically loads SheetJS library and generates downloadable XLSX files.",
  "frontend/src/utils/clientCsv.ts": "CSV template generation, parsing, and validation utilities for bulk client uploads with name, GSTIN, PAN, and notes fields.",
  "frontend/src/utils/clientExcel.ts": "Excel export utility for clients that dynamically loads SheetJS library and generates downloadable XLSX files with client details.",
  "frontend/src/utils/taskAggregations.ts": "Task aggregation utilities that calculate statistics by category, sub-category, status, and revenue with comprehensive task stats computation.",
  "frontend/src/utils/taskCsv.ts": "Provides CSV parsing and validation for bulk task uploads, including template generation, date/number parsing, and validation of required fields (Client Name, Task Category, Sub Category) plus optional fields like status, dates, and payment information.",
  "frontend/src/utils/taskDisplay.ts": "Shared utilities for consistent task data formatting including date conversion from nanosecond timestamps, currency formatting in INR, and assignee name display with captain information.",
  "frontend/src/utils/taskExcel.ts": "Handles Excel export of tasks by dynamically loading SheetJS library and converting task data (including optional captain names) into formatted Excel workbooks with proper date and currency formatting.",
  "frontend/src/utils/taskSort.ts": "Implements multi-field sorting for tasks with support for ascending/descending order across dates, status, categories, assignees, and amounts, handling null/undefined values by pushing them to the end.",
  "frontend/src/utils/todoCsv.ts": "Provides CSV template generation and parsing for bulk todo uploads, validating fields like title (required), description, completed status, priority, and due date with proper quote handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage support for maintaining state across navigation and methods to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, container queries, animations, and custom font families (Inter and Georgia).",
  "frontend/vite.config.ts": "Vite build configuration for React app with path aliases, dev server on port 3000, API proxy to localhost:4943, and optimized build settings for Internet Computer deployment.",
  "project_state.json": "Project state tracking document indicating a task management app on Internet Computer with known issues around task loading failures, HTTP 503 errors, and data fetching problems in TasksPage.tsx."
}