{
  "backend/main.mo": "Motoko canister defining clients, tasks, assignees, user profiles, and access‑controlled CRUD operations with per‑caller storage maps.",
  "feature_evidence.json": "Feature evidence report describing a fix for Radix Select crashes and listing affected files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files including pages, components, hooks, and config.",
  "frontend/index.css": "Tailwind base styles plus custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication flow, profile setup gating, deferred URL cleanup, and top‑level routing.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog for bulk uploading assignees via CSV with parsing, validation, and mutation handling.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Modal form to create, edit, or delete an assignee with validation and mutation hooks.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Always-open modal prompting the user to enter and save their name on first setup.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Public landing screen with branding and a login button for Internet Identity sign‑in.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for uploading a CSV, validating rows, previewing results, and bulk‑creating clients.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Modal for creating, editing, or deleting a client with field validation and mutation calls.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "Error boundary that catches startup errors and displays a fallback screen.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Fallback UI shown on startup errors with a reload button.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, mobile menu, user dropdown, and logout handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk-editing multiple tasks, building update objects conditionally and submitting them via bulkUpdateTasks.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for uploading tasks from CSV, showing parsed results and validation errors, and submitting new tasks via bulkCreateTasks.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Read-only panel displaying all task fields with formatted dates, currency, and labels.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Create/edit task dialog with full form state management, status coercion, and submit handling for create or update mutations.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline status selector that updates a task’s status using updateTask.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses and utilities for normalizing, validating, coercing, and displaying them.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for CRUD and bulk operations on assignees using the backend actor.",
  "frontend/src/hooks/clients.ts": "Provides React Query hooks for CRUD and bulk operations on clients through the actor API.",
  "frontend/src/hooks/tasks.ts": "Defines React Query hooks for fetching, creating, updating, deleting, and bulk operations on tasks.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and updates the caller's user profile using the actor with React Query caching.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Reads secret URL parameters into session storage and removes them from the URL on mount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, identity loading, and related state.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light and dark theme palettes.",
  "frontend/src/lib/dataParser.ts": "Deprecated helpers for parsing and encoding legacy client data structures.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AssigneesPage.tsx": "Renders the assignees management page with search, selection, bulk delete, and edit dialog functionality.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed information for a single client, including task stats, related tasks, and edit/create dialogs.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients with search, selection, bulk delete, and bulk upload, plus client creation/editing dialogs.",
  "frontend/src/pages/DashboardPage.tsx": "Shows task-based business metrics such as revenue, upcoming and overdue tasks, and status summaries.",
  "frontend/src/pages/TasksPage.tsx": "Provides full task management with filtering, sorting, bulk actions, uploads, exports, and task create/edit dialogs.",
  "frontend/src/utils/assigneeCsv.ts": "Generates and parses CSV files for assignee bulk upload, including validation and backend formatting helpers.",
  "frontend/src/utils/clientCsv.ts": "Generates and parses client CSV uploads with validation and conversion to backend-ready structures.",
  "frontend/src/utils/taskAggregations.ts": "Computes aggregated task metrics including revenue by category, status counts, and overall task statistics.",
  "frontend/src/utils/taskCsv.ts": "CSV utilities for generating a task template and parsing/validating task data with extended fields.",
  "frontend/src/utils/taskDisplay.ts": "Helpers for rendering task fields, including date, currency, and optional text formatting with placeholders.",
  "frontend/src/utils/taskExcel.ts": "Converts tasks to SheetJS-friendly data and exports them to an Excel file, loading XLSX from CDN if needed.",
  "frontend/src/utils/taskSort.ts": "Sorting utilities for tasks across multiple fields with safe comparisons for null and formatted statuses.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme, colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing architecture, issues, and feature requirements for the task/client management app."
}