{
  "backend/main.mo": "Motoko canister managing per-user clients, tasks, and profiles with access control and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, dark mode variables, and global element styling.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication gating, profile setup flow, and routes for dashboard, clients, and tasks.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users to enter and save their name on first login.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Public landing screen with sign‑in button and feature highlights for unauthenticated users.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog component for creating, editing, and deleting clients with form validation and data encoding.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, user menu, and mobile sidebar handling.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog component for creating, editing, and deleting tasks, including client selection and deadline handling.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline task status selector that updates a task’s status via mutation.",
  "frontend/src/hooks/clients.ts": "React Query hooks for fetching and mutating client data through the actor API.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for fetching and mutating task data, including per-client and individual queries.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches the backend actor, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for retrieving and saving the current user’s profile via the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identity state, and exposing login status helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light and dark themes using OKLCH values.",
  "frontend/src/lib/dataParser.ts": "Implements helpers to encode and decode Client and Task records, parsing contact info, status, tax years, priority, and deadlines.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed client info and related tasks, handling loading, error states, and editing via a dialog.",
  "frontend/src/pages/ClientsPage.tsx": "Shows a searchable, filterable list of clients with add-client dialog support and loading/error handling.",
  "frontend/src/pages/DashboardPage.tsx": "Renders dashboard metrics summarizing clients and tasks, with navigation shortcuts and full loading/error states.",
  "frontend/src/pages/TasksPage.tsx": "React page that fetches, parses, filters, and sorts tasks with client data, URL-based filters, and a task creation dialog.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing features, requirements, imagery, and current state for a task/client management app."
}