{
  "backend/main.mo": "Main backend actor managing clients, tasks, and user profiles with access control, per-caller storage, and creation/query functions.",
  "backend/migration.mo": "Migration module converting old client records to the new Client format while preserving other actor state.",
  "feature_evidence.json": "Machine-generated report listing features, associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short descriptions summarizing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind-based global styles defining color tokens, dark mode variables, and base styling.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, root div, and loading the main script.",
  "frontend/src/App.tsx": "Sets up React Router, authentication gating, the main layout, and routes for dashboard, clients, and tasks.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter their name and saving the profile via a mutation hook.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Displays the public sign‑in screen with branding, feature highlights, and an Internet Identity login button.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Provides a dialog to upload, parse, validate, and submit a CSV file for bulk client creation.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Form dialog for creating, editing, or deleting a single client with validation and CRUD hooks.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, user menu, mobile sidebar, and logout handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog enabling bulk editing of selected tasks by applying shared field updates using a bulk update hook.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog component for uploading a CSV to bulk‑create tasks, including file parsing, validation display, and submit handling.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Form dialog for creating, editing, or deleting a single task with extensive field handling and validation.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline status selector that updates a task’s status via mutation.",
  "frontend/src/hooks/clients.ts": "React Query hooks for fetching, creating, updating, deleting, and bulk‑modifying clients through the backend actor.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for CRUD and bulk operations on tasks using the backend actor.",
  "frontend/src/hooks/useActor.ts": "Manages creation and lifecycle of the backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for retrieving and saving the current caller’s user profile through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/index.css": "Defines Tailwind layers and custom OKLCH-based theme variables for light and dark modes, applying global borders and base body styles.",
  "frontend/src/lib/dataParser.ts": "Provides deprecated helpers for parsing and encoding client data into a simple object structure for backward compatibility.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts the main App component.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed client info, loads associated tasks, shows stats, and provides edit and task creation dialogs.",
  "frontend/src/pages/ClientsPage.tsx": "Lists clients with search, selection, bulk delete, and upload features, plus dialog support for adding clients.",
  "frontend/src/pages/DashboardPage.tsx": "Shows high-level client and task statistics using data from hooks with a styled dashboard header.",
  "frontend/src/pages/TasksPage.tsx": "Displays filterable and sortable tasks with bulk operations, creation/edit dialogs, and task status tools.",
  "frontend/src/utils/clientCsv.ts": "Implements CSV template generation, download, parsing, validation, and conversion for bulk client uploads.",
  "frontend/src/utils/taskCsv.ts": "Provides CSV template generation, download, and parsing with validation for bulk task uploads.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and includes typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing current features, requirements, and state version for a task/client management app."
}