{
  "backend/main.mo": "Main Motoko actor defining the backend API with CRUD operations for Clients, Tasks, Assignees, and Todos, including user profiles, access control via MixinAuthorization, and per-user data isolation using nested Maps keyed by Principal.",
  "feature_evidence.json": "Feature evidence report documenting the Dashboard page visual design update (enhanced spacing, typography, color accents, shadows) with high confidence mapping to frontend/src/pages/DashboardPage.tsx and test ID REQ-107.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing routing, authentication, CRUD hooks with optimistic updates, UI components (dialogs, tables, forms), search/filter/bulk operations, and defensive error handling patterns.",
  "frontend/.ic-assets.json5": "Asset configuration for the Internet Computer frontend canister defining MIME types, cache policies (1-year for static assets, no-cache for HTML), and security headers including CSP, X-Frame-Options, and X-Content-Type-Options.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors (background, foreground, primary, secondary, muted, destructive, sidebar) and border radius using oklch color space.",
  "frontend/index.html": "HTML entry point for the React SPA with CSWA favicon, viewport meta tag, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, authentication flow using Internet Identity, profile setup modal for new users, defensive search parameter validation for tasks route, deferred URL cleanup hook, and error boundary wrapper.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV with template download, file parsing, validation error display, preview table, and submission using useBulkCreateAssignees mutation with loading states and error handling.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting assignees (teams) with form validation for name and captain fields. Includes confirmation dialog for deletion and uses React Query mutations for backend operations.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name on first login. Cannot be dismissed and saves the profile using a mutation hook.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA branding, Internet Identity sign-in button, and three feature cards describing client management, task tracking, and dashboard insights.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV file with template download, file parsing, validation error display, and preview table. Uses bulk create mutation to process validated rows.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog component for creating, editing, and deleting clients with fields for name, GSTIN, PAN, and notes. Includes form validation and delete confirmation dialog.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors and displays a fallback error screen. Logs errors to console for debugging.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error fallback UI displaying an alert icon, error message, and reload button when the application fails to start.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sticky header, navigation sidebar (responsive with mobile sheet), user avatar dropdown menu, and logout functionality. Includes navigation to dashboard, clients, tasks, assignees, and todos.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Provides an inline editor for task comments with edit/save/cancel controls, using a mutation hook to update comments and displaying errors inline.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple tasks at once, allowing users to update common fields (client, category, status, dates, payment info) across selected tasks using an unchanged sentinel pattern.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk uploading tasks via CSV file, with template download, file parsing, validation preview, and sequential task creation.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Card component displaying comprehensive task details including client info, dates, financial data, payment status, and comments in a formatted layout.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating or editing tasks with combobox inputs for clients/categories/assignees, date pickers, financial fields, and status selection using sentinel values for null states.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Dropdown component for quickly updating a task's status inline, using a sentinel value for null status and triggering a full task update mutation.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog component for bulk uploading todos via CSV file, with template download, file parsing, validation preview, and batch creation functionality.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog component for creating, editing, and deleting individual todos with form fields for title, description, completion status, priority, and due date.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses, provides normalization and validation functions, and maps legacy status values to current equivalents.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for CRUD operations on assignees, including optimistic updates and bulk creation support.",
  "frontend/src/hooks/clients.ts": "React Query hooks for CRUD operations on clients, including optimistic updates and bulk creation support.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for CRUD operations on tasks with captain information, including optimistic updates, partial updates, and bulk creation/deletion support.",
  "frontend/src/hooks/todos.ts": "Provides React Query hooks for CRUD operations on todos (get all, get one, create, update, delete, bulk create) with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token from URL params and invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current authenticated user's profile, with proper error handling and authentication checks.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Hook that captures secret parameters (caffeineAdminToken) from URL hash, stores them in sessionStorage, and removes them from URL after component mount to prevent router issues.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider with login/logout functionality, identity persistence, and configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using warm neutrals, sage green primary, and charcoal tones for both light and dark modes.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility for parsing and encoding client data; now kept only for backward compatibility as Client model uses explicit fields without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, bulk selection, bulk delete, create/edit dialogs, and bulk upload functionality using table display.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed information for a single client with a dropdown selector to switch between clients, shows associated tasks, and provides edit functionality via a dialog.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients in a searchable table with bulk selection, deletion, and upload capabilities; includes buttons to add new clients and navigate to detail pages.",
  "frontend/src/pages/DashboardPage.tsx": "Shows an overview dashboard with statistics (clients, tasks, assignees), revenue aggregations by category/subcategory, status breakdowns, and lists of upcoming and overdue tasks with navigation to filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Displays a filterable and sortable table of tasks with search, status/category/client/assignee filters, bulk operations (edit, delete, upload), inline comment editing, quick status updates, and Excel export functionality.",
  "frontend/src/pages/TodosPage.tsx": "Shows a list of todos with search and completion filtering, supports bulk selection and deletion, and provides add/edit functionality through a dialog and bulk upload.",
  "frontend/src/utils/assigneeCsv.ts": "Provides utilities for generating, downloading, parsing, and validating CSV files for bulk assignee uploads with team name and captain fields.",
  "frontend/src/utils/clientCsv.ts": "Provides CSV template generation, parsing, and validation utilities for bulk client uploads with fields like name, GSTIN, PAN, and notes.",
  "frontend/src/utils/taskAggregations.ts": "Aggregates task data by category, sub-category, and status to calculate revenue totals, counts, and comprehensive task statistics for reporting.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV template generation and parsing for bulk task uploads with extensive field support including dates, financial data, and validation.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for task display including date conversion from bigint nanoseconds, currency formatting, and placeholder handling.",
  "frontend/src/utils/taskExcel.ts": "Exports tasks to Excel format by dynamically loading SheetJS library from CDN and converting task data to spreadsheet format.",
  "frontend/src/utils/taskSort.ts": "Implements multi-field sorting for tasks with ascending/descending direction support, handling null values and various data types (bigint, string, number).",
  "frontend/src/utils/todoCsv.ts": "Manages CSV template generation, parsing, and validation for bulk todo uploads with fields like title, description, completion status, priority, and due date.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and clean up URL parameters (e.g., admin tokens) from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and design tokens for a component library. Configures dark mode, custom fonts (Inter, Georgia), border radius variables, and accordion animations.",
  "project_state.json": "Project state document for a tax consulting task/client management app, tracking architectural decisions, known issues (blank screen/loading hangs, task edit failures, admin token URL handling), and existing features. Documents TanStack Router initialization issues and Radix Select empty-string validation problems."
}