{
  "backend/main.mo": "Main Motoko actor implementing a multi-tenant task management system with clients, tasks, assignees, and todos. Includes role-based access control (admin/user), per-principal data isolation, CRUD operations, and query functions for aggregated dashboard metrics.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence UI redesign requirements: updating the color theme to a modern palette, redesigning the dashboard layout with contemporary card designs, and modernizing application layout components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend React components and hooks, describing authentication flows, layout components, CRUD pages for clients/tasks, form dialogs, and React Query hooks with error handling and optimistic updates.",
  "frontend/.ic-assets.json5": "Asset configuration for Internet Computer frontend canister defining content types, cache policies (31536000s for static assets, no-cache for HTML), and security headers including CSP, X-Frame-Options, and X-Content-Type-Options.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for backgrounds, foregrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with extensive diagnostic logging for asset loading, HTTP 503 error detection, canister ID extraction, and performance monitoring to troubleshoot Internet Computer asset canister service availability issues.",
  "frontend/src/App.tsx": "Main application entry point that sets up routing, authentication, query client, and theme provider. Includes comprehensive loading timeout diagnostics and handles profile setup flow for authenticated users.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV file. Provides template download, file parsing with validation, preview of parsed rows, and submission to backend using bulk create mutation.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Form dialog for creating, editing, and deleting individual assignees with team name and captain fields. Includes validation, loading states, and confirmation dialog for deletions.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name for profile setup. Cannot be dismissed until profile is saved.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA branding, sign-in button with Internet Identity, and feature cards showcasing platform capabilities with decorative gradient backgrounds.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog component for bulk uploading clients via CSV file. Provides template download, file parsing with validation, scrollable preview table, and submission with success feedback.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog component for creating, editing, and deleting clients with form validation for name, GSTIN, PAN, and notes fields. Manages form state, validation errors, and integrates with client mutation hooks.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors, logs detailed error information to console, and displays a custom error screen. Provides a reload handler that clears storage before reloading the application.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error screen UI component that displays categorized error information with troubleshooting steps, copy-to-clipboard functionality, and conditional development-mode stack traces. Categorizes errors into network, authentication, backend connection, navigation, or general application errors.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with sticky header, navigation menu (Dashboard, Clients, Tasks, Assignees, Todos), user profile dropdown, and logout functionality. Includes responsive mobile sheet menu and social media links in the footer.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editable comment field for tasks with edit/save/cancel controls and keyboard shortcuts (Enter to save, Escape to cancel). Displays comment text with hover-to-edit button when not in edit mode.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple tasks simultaneously with selective field updates using an unchanged sentinel pattern. Provides dropdowns for client, status, assignee, and form inputs for categories, dates, and payment fields, only updating fields that have been explicitly changed.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog component for bulk uploading tasks via CSV file. Provides template download, file parsing, validation preview, and sequential task creation with error handling.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Card component displaying detailed task information including client name, category, status, dates, financial details (bill, advance, outstanding), payment status, and comments in a formatted grid layout.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating and editing tasks with combobox inputs for client, category, subcategory, status, and assignee, plus fields for dates, financial data, and comments. Supports both create and update operations.",
  "frontend/src/components/tasks/TaskListSkeleton.tsx": "Loading skeleton component that renders animated placeholder rows for the task table with configurable row count and optional checkbox columns.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline status dropdown component for quickly updating a task's status without opening the full edit dialog. Handles status coercion and null values with a sentinel.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog component for bulk uploading todos via CSV file. Includes template generation, CSV parsing, validation preview table, and bulk creation with success/error feedback.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "React dialog component for creating and editing todos with form fields for title, description, completed status, priority, and due date. Includes delete functionality with confirmation dialog and uses React Query mutations for CRUD operations.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses (Pending, Docs Pending, In Progress, Checking, Payment Pending, Completed, Hold) and provides utility functions for normalizing, validating, and mapping legacy status values to current ones.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for assignee CRUD operations including fetching all assignees, fetching single assignee, creating, updating, and deleting assignees with optimistic updates and toast notifications.",
  "frontend/src/hooks/clients.ts": "React Query hooks for client CRUD operations including fetching all clients, fetching single client, creating, updating, and deleting clients with optimistic updates and toast notifications.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for task operations including fetching all tasks with captain info, pagination utilities, and detailed logging for debugging. Includes stale time and cache configuration to optimize refetch behavior.",
  "frontend/src/hooks/todos.ts": "React Query hooks for todo CRUD operations including fetching all todos, fetching single todo, creating, updating, and deleting todos with optimistic updates and query invalidation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializes access control with admin token from URL, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks for fetching and saving the current user's profile, with proper loading state management that accounts for actor and authentication initialization.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Extracts caffeineAdminToken from URL hash on mount, stores it in sessionStorage, and removes the hash from the URL after a 100ms delay to prevent visual flashing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state, delegation validation, and auth client lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a modern color palette (deep teal, coral, purple) for both light and dark modes using oklch color space.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility for parsing and encoding client data; now obsolete as client data is stored directly without encoding in the new backend model.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Displays a searchable, filterable table of assignees with bulk selection, delete, export to Excel, and dialogs for creating/editing assignees and bulk upload.",
  "frontend/src/pages/ClientDetailPage.tsx": "Shows detailed view of a single client with a dropdown selector to switch between clients, edit dialog, and displays all tasks associated with that client.",
  "frontend/src/pages/ClientsPage.tsx": "Displays a searchable, filterable table of clients with bulk operations (delete, export to Excel), authentication-gated create/edit dialogs, and CSV bulk upload functionality.",
  "frontend/src/pages/DashboardPage.tsx": "Renders a dashboard with summary metrics (total tasks, clients, revenue, pending tasks) and aggregated task data by category, subcategory, and status with modern gradient styling.",
  "frontend/src/pages/TasksPage.tsx": "Comprehensive task management page with search, filtering by client/category/status, sorting, pagination, bulk operations (delete, edit), inline comment editing, quick status updates, and Excel export with enhanced query state logging.",
  "frontend/src/pages/TodosPage.tsx": "Todo list page with search, completion filtering, bulk selection/deletion, and create/edit dialogs with bulk CSV upload support.",
  "frontend/src/utils/assetLoadingDiagnostics.ts": "Diagnostic utility that intercepts global errors and fetch requests to log asset loading failures with special HTTP 503 detection, timing data, and environment information for debugging canister asset serving issues.",
  "frontend/src/utils/assigneeCsv.ts": "Utilities for generating, downloading, parsing, and validating CSV files for bulk assignee uploads with team name and captain fields.",
  "frontend/src/utils/assigneeExcel.ts": "Dynamically loads SheetJS library and exports assignee data (team name and captain) to an Excel file with date-stamped filename.",
  "frontend/src/utils/clientCsv.ts": "Provides CSV template generation, parsing, and validation for bulk client uploads with fields for name, GSTIN, PAN, and notes.",
  "frontend/src/utils/clientExcel.ts": "Dynamically loads SheetJS library and exports client data (name, GSTIN, PAN, notes) to an Excel file with date-stamped filename.",
  "frontend/src/utils/taskAggregations.ts": "Aggregates task data by category, sub-category, status, and combinations thereof to calculate revenue, counts, and comprehensive task statistics.",
  "frontend/src/utils/taskCsv.ts": "Provides CSV template generation, parsing, and validation for bulk task uploads with support for all task fields including dates, financial data, and assignments.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for task display including date conversion from nanosecond timestamps, currency formatting, and assignee name formatting with captain information.",
  "frontend/src/utils/taskExcel.ts": "Dynamically loads SheetJS library and exports task data with all fields (including captain names) to an Excel file with formatted dates and date-stamped filename.",
  "frontend/src/utils/taskSort.ts": "Provides sorting functionality for tasks by multiple fields (dates, status, categories, financial data) with ascending/descending direction and null-safe comparisons.",
  "frontend/src/utils/todoCsv.ts": "Provides CSV parsing and generation utilities for bulk todo upload, including template generation, CSV line parsing with quote handling, row validation, and conversion to PartialTodoInput format.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with OKLCH color variables, custom font families, extended spacing/shadows, and animation keyframes for a modern UI theme supporting light and dark modes.",
  "frontend/vite.config.ts": "Vite build configuration for React app with path aliases, dev server on port 3000, API proxy to local canister at port 4943, and optimized build settings.",
  "project_state.json": "Project state tracking document showing a dashboard application with completed UI redesign features (color theme, dashboard layout, navigation) and known backend connection issues."
}