{
  "backend/main.mo": "Main Motoko actor defining persistent data structures (clients, tasks, assignees, todos, userProfiles) with CRUD operations, authorization via MixinAuthorization, and type definitions for Client, Task, Assignee, Todo, and related input/update types.",
  "feature_evidence.json": "Feature evidence report documenting that frontend/.ic-assets.json5 implements correct Content-Type headers for JavaScript files (application/javascript) to fix MIME type issues.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing components, pages, hooks, and utilities with implementation details for client/task/assignee/todo management, authentication, routing, and data fetching.",
  "frontend/.ic-assets.json5": "Asset configuration for ICP deployment specifying Content-Type headers for JS/CSS/HTML/images/fonts, cache policies (31536000s for static assets, no-cache for HTML), and security headers (CSP, X-Frame-Options, X-Content-Type-Options).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point with CSWA favicon, viewport meta tag, page title, root div mount point, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup defining routes (dashboard, clients, tasks, assignees, todos), authentication flow, profile setup modal, loading states, error boundary, and deferred URL cleanup hook.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV with template download, file parsing, validation error display, preview table, and submission using useBulkCreateAssignees hook with loading/error states.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting assignees (teams) with form validation for name and captain fields. Includes confirmation dialog for deletion and handles loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup. Cannot be dismissed until a name is provided.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA branding, Internet Identity sign-in button, and feature cards highlighting client management, task tracking, and dashboard capabilities.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV file with template download, file parsing, validation error display, and preview table. Converts parsed rows to backend format before submission.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog component for creating, editing, and deleting individual clients with fields for name, GSTIN, PAN, and notes. Includes form validation and delete confirmation.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors and displays a fallback error screen. Logs errors to console for debugging.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error fallback UI displaying an alert icon, error message, and reload button when the application fails to start.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sticky header, responsive navigation (desktop sidebar and mobile sheet), user profile dropdown with logout, and navigation links for Dashboard, Clients, Tasks, Assignees, and Todos.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Provides an inline editor for task comments with edit/save/cancel controls, using hover-to-reveal edit button and keyboard shortcuts (Enter to save, Escape to cancel).",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple selected tasks with form fields for all task properties, using an unchanged sentinel pattern to only update explicitly modified fields.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk uploading tasks via CSV file with template download, file parsing, validation error display, and sequential task creation.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Card component displaying comprehensive read-only task details including client info, dates, financial data, payment status, and comments in a structured grid layout.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating or editing individual tasks with combobox inputs for clients/categories/assignees, date pickers, and financial fields, supporting both create and update modes.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Dropdown component for quickly changing a task's status inline, handling null/empty status values with a sentinel pattern and triggering full task updates.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog component for bulk uploading todos via CSV file, with template download, file parsing, validation preview, and batch creation using React hooks and shadcn/ui components.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog component for creating, editing, and deleting individual todos with form fields for title, description, completion status, priority, and due date, using React hooks for mutations.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses (Pending, In Progress, Completed, etc.) with utility functions for normalizing legacy statuses, validation, and safe coercion for Select components.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for CRUD operations on assignees including optimistic updates, with support for bulk creation and query invalidation.",
  "frontend/src/hooks/clients.ts": "React Query hooks for CRUD operations on clients with optimistic updates, query caching, and support for bulk creation operations.",
  "frontend/src/hooks/tasks.ts": "React Query hooks for task CRUD operations including fetching tasks with captain info, optimistic updates with comprehensive field support (status, dates, billing, assignments), and query invalidation.",
  "frontend/src/hooks/todos.ts": "Provides React Query hooks for CRUD operations on todos (get all, get one, create, update, delete, bulk create) with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token from URL parameters and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current authenticated user's profile, with error handling and conditional query enabling based on authentication state.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Post-mount effect hook that captures secret parameters (caffeineAdminToken) from URL hash, stores them in sessionStorage, and removes them from the URL to prevent router hangs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider with login/logout functionality, identity persistence, and configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using warm neutrals, sage green primary, and charcoal tones for both light and dark modes.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility for parsing and encoding client data; now obsolete as Client model uses explicit fields without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees with search, bulk selection, bulk delete, create/edit dialogs, and bulk upload functionality using table display.",
  "frontend/src/pages/ClientDetailPage.tsx": "Displays detailed information for a single client with a dropdown selector to switch between clients, shows associated tasks, and provides edit functionality via a dialog.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all clients in a searchable table with bulk selection, deletion, and upload capabilities; includes buttons to add new clients and navigate to detail pages.",
  "frontend/src/pages/DashboardPage.tsx": "Shows overview statistics (clients, tasks, assignees), revenue aggregations by category/subcategory/status, and lists upcoming and overdue tasks with navigation to filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Displays a filterable and sortable task table with search, status/category/client/assignee filters, bulk operations (edit, delete, export to Excel), inline comment editing, and quick status updates.",
  "frontend/src/pages/TodosPage.tsx": "Manages a list of todos with search, completion filtering, bulk selection/deletion, and add/edit functionality via dialogs and bulk upload support.",
  "frontend/src/utils/assigneeCsv.ts": "Provides CSV template generation, parsing, and validation utilities for bulk assignee uploads with team name and captain fields.",
  "frontend/src/utils/clientCsv.ts": "Provides CSV template generation, parsing, and validation utilities for bulk client uploads with fields like name, GSTIN, PAN, and notes.",
  "frontend/src/utils/taskAggregations.ts": "Aggregates task data by category, sub-category, and status to calculate revenue, counts, and comprehensive task statistics for reporting and analytics.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV template generation and parsing for bulk task uploads with validation for all task fields including dates, financials, and assignments.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for displaying task data including date conversion from bigint nanoseconds, currency formatting, and placeholder handling.",
  "frontend/src/utils/taskExcel.ts": "Exports tasks to Excel format by dynamically loading SheetJS library from CDN and converting task data to spreadsheet-friendly format.",
  "frontend/src/utils/taskSort.ts": "Implements multi-field sorting for tasks with ascending/descending direction support, handling null values and various data types (bigint, string, number).",
  "frontend/src/utils/todoCsv.ts": "Manages CSV template generation, parsing, and validation for bulk todo uploads with fields like title, description, completion status, priority, and due date.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both standard query strings and hash-based routing. Includes special handling for reading and removing secret parameters from URL hashes without triggering page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system with CSS variables, typography, container queries, animations (accordion), and custom font families. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document (version 61) for a tax consulting task/client management app, tracking architectural decisions, known issues (including production blank screen/loading hangs, task edit failures, and URL parameter handling bugs), and existing features with Internet Identity authentication."
}