{
  "backend/main.mo": "Motoko canister managing clients, tasks, assignees, and user profiles with access‑controlled CRUD operations and per‑caller storage maps.",
  "feature_evidence.json": "Feature evidence report mapping three frontend task‑form related features to their modified files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for quick build‑planning reference.",
  "frontend/index.css": "Global Tailwind CSS layer defining theme tokens and dark‑mode variables in OKLCH color space.",
  "frontend/index.html": "HTML entry point mounting the React app and linking favicon and main script.",
  "frontend/src/App.tsx": "Main React router setup handling authentication, profile bootstrapping, and page routing.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog for uploading assignees via CSV with parsing, validation, preview, and bulk‑create mutation.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog form for creating, editing, and deleting assignees with validation and mutation hooks.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting a newly signed-in user to save their display name using a profile mutation.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing screen for logged‑out users providing branding, feature highlights, and an Internet Identity login button.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for CSV-based client bulk upload including template download, parsing, validation, and batch creation.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog form for creating, editing, and deleting a single client with basic validation and mutation hooks.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, header, responsive mobile menu, and user profile/logout handling.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Bulk editing dialog that applies selected field updates to multiple tasks and submits them via a bulk update hook.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for uploading tasks from a CSV file, validating entries, and submitting them through a bulk create hook.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Form dialog for creating or editing a single task, handling all task fields and submitting via create or update hooks.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline status selector for quickly updating a task’s status using the update hook.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses with helpers for normalization, validation, and display mapping.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for CRUD and bulk operations on assignees using the backend actor.",
  "frontend/src/hooks/clients.ts": "React Query hooks for CRUD and bulk operations on clients through the backend actor.",
  "frontend/src/hooks/tasks.ts": "Provides React Query hooks for CRUD and bulk operations on tasks using the actor API, with automatic cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Exposes hooks to fetch and save the current user's profile via the actor with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading and managing identities and login state with AuthClient.",
  "frontend/src/index.css": "Defines Tailwind layers and custom color variables for light and dark themes.",
  "frontend/src/lib/dataParser.ts": "Deprecated utilities for parsing and encoding client data kept for backward compatibility.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AssigneesPage.tsx": "Displays, filters, edits, and bulk-manages assignees with dialogs and deletion workflows.",
  "frontend/src/pages/ClientDetailPage.tsx": "Shows detailed client info with related tasks, stats, and dialogs for editing and task creation.",
  "frontend/src/pages/ClientsPage.tsx": "Clients listing page with search, selection, bulk delete, and dialogs for create and CSV upload.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing task statistics, revenue summaries, and upcoming/overdue tasks with navigation filters.",
  "frontend/src/pages/TasksPage.tsx": "Tasks table with search, filtering, bulk actions, and dialogs for create, edit, upload, and delete.",
  "frontend/src/utils/assigneeCsv.ts": "Generates and parses CSV files for assignee bulk upload with validation and backend mapping.",
  "frontend/src/utils/clientCsv.ts": "Generates and parses client CSV files for bulk upload, validating required fields and formatting output.",
  "frontend/src/utils/taskAggregations.ts": "Provides functions to compute task statistics including revenue, status counts, and category totals.",
  "frontend/src/utils/taskCsv.ts": "Generates task upload CSV templates and parses task CSV files with validation for all task fields.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL query/hash params, persist them in sessionStorage, and clear them from the hash without page reload.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Describes the project’s current state, requirements, features, known issues, and architectural notes for a task/client management app."
}