{
  "backend/main.mo": "Main Motoko actor implementing a multi-tenant task management system with clients, tasks, assignees, and todos, using role-based access control and per-user data isolation via Principal-keyed maps.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to diagnosing production loading failures, enhanced error logging during startup, and verification of the useDeferredUrlCleanup hook behavior.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App.tsx with TanStack Router, authentication flow, dashboard with metrics, client/task management pages with search and bulk operations, and React Query hooks for data fetching.",
  "frontend/.ic-assets.json5": "Asset configuration for Internet Computer frontend defining cache policies, content types, and security headers (CSP, X-Frame-Options) for various file types including JS, CSS, HTML, images, and fonts.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and sidebar components using OKLCH color space.",
  "frontend/index.html": "HTML entry point with early error detection scripts, noscript fallback message, CSWA favicon, and module script loading for the React application at /src/main.tsx.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, authentication flow using Internet Identity, comprehensive logging at initialization stages, 10-second loading timeout detection, error boundary wrapper, and conditional rendering of SignedOutScreen or authenticated AppLayout with ProfileSetupModal.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV file. Provides template download, file parsing with validation, preview table, and submission to backend using useBulkCreateAssignees hook.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting individual assignees with team name and captain fields. Includes form validation and uses create/update/delete hooks with loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that prompts new users to enter their name on first login. Non-dismissible dialog that calls useSaveCallerUserProfile hook on submission.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA logo, sign-in button using Internet Identity, and three feature cards describing client management, task tracking, and dashboard capabilities.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV with template download, file parsing, validation error display, and preview table. Uses useBulkCreateClients hook and shows success state before auto-closing.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Form dialog for creating, editing, and deleting individual clients with fields for name, GSTIN, PAN, and notes. Includes validation, delete confirmation dialog, and uses client CRUD hooks.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches application startup errors, logs detailed error information to console, and displays a startup error screen with option to reload and clear storage.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error screen UI component that displays categorized error details (network, auth, backend, navigation), provides troubleshooting steps, and offers actions to copy error details or reload the application.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with sticky header, responsive navigation (desktop sidebar and mobile sheet menu), user profile dropdown with logout, and navigation items for Dashboard, Clients, Tasks, Assignees, and Todos.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editable comment field for tasks that shows comment text with hover-to-edit button, switches to input mode with save/cancel actions, and handles keyboard shortcuts (Enter to save, Escape to cancel).",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog component for bulk editing multiple selected tasks, allowing users to update common fields (client, category, status, dates, payment info) with an unchanged sentinel pattern to only modify explicitly changed fields.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk task creation via CSV upload, provides template download, parses uploaded CSV files, validates data, displays preview table with errors, and sequentially creates tasks from valid rows.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Displays detailed task information in a card layout, including client name, category, status badge, assigned team with captain, dates, financial amounts (bill, advance, outstanding), payment status, and optional comments.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating and editing tasks with fields for client, category, subcategory, status, assignee, dates, and financial data. Uses comboboxes populated from existing tasks/clients/assignees and handles form validation and submission.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline select dropdown component for quickly updating a task's status without opening the full edit dialog. Uses a sentinel value to represent null/empty status.",
  "frontend/src/components/todos/TodoBulkUploadDialog.tsx": "Dialog for bulk uploading todos via CSV file, with template download, file parsing, validation preview table showing valid/invalid rows, and batch creation functionality.",
  "frontend/src/components/todos/TodoFormDialog.tsx": "Dialog form for creating, editing, and deleting todos with fields for title, description, completed checkbox, priority, and due date. Includes confirmation dialog for deletion.",
  "frontend/src/constants/taskStatus.ts": "Defines allowed task statuses as constants, provides legacy status mapping (To Do→Pending, Done→Completed, Blocked→Hold), and exports utility functions for normalizing, validating, and displaying status values.",
  "frontend/src/hooks/assignees.ts": "React Query hooks for assignee CRUD operations (get all, get one, create, update, delete, bulk create) with optimistic updates and cache invalidation.",
  "frontend/src/hooks/clients.ts": "Provides React Query hooks for client CRUD operations (get all, get by ID, create, update, delete, bulk create) with optimistic updates and cache invalidation.",
  "frontend/src/hooks/tasks.ts": "Provides React Query hooks for task CRUD operations including getAllTasksWithCaptain, with optimistic updates for task modifications and cache management.",
  "frontend/src/hooks/todos.ts": "Provides React Query hooks for todo CRUD operations (get all, get by ID, create, update, delete, bulk create) with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current authenticated user's profile, with proper loading states and cache invalidation.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Extracts caffeineAdminToken from URL hash on mount, stores it in sessionStorage, and cleans the URL after a delay to ensure router initialization completes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm neutral/sage green color palette for light and dark modes, including primary, secondary, accent, destructive, and chart colors.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility file for parsing and encoding client data; now kept only for backward compatibility since the Client model uses explicit fields without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees (teams and captains) with search, bulk selection, bulk delete, bulk upload, and edit functionality using data tables and dialogs.",
  "frontend/src/pages/ClientDetailPage.tsx": "Detail page for viewing a single client with client selector dropdown, edit functionality, and a list of associated tasks with expandable task details panel.",
  "frontend/src/pages/ClientsPage.tsx": "Page component for managing clients with search, bulk selection, bulk delete, and bulk upload functionality displayed in a data table.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard overview page displaying summary metrics (total tasks, clients, revenue, pending tasks) and aggregated task data by category, subcategory, status, and combined views in tables.",
  "frontend/src/pages/TasksPage.tsx": "Comprehensive tasks management page with search, multi-field filtering (status, category, client, assignee, overdue), sorting, bulk operations (edit, delete, upload), Excel export, and inline editing capabilities.",
  "frontend/src/pages/TodosPage.tsx": "Main page component for managing todos with filtering, search, bulk selection/deletion, and dialogs for creating/editing/uploading todos. Uses React hooks for state management and displays todos in a table with checkboxes.",
  "frontend/src/utils/assigneeCsv.ts": "Utilities for generating, downloading, and parsing CSV files for bulk assignee/team uploads with validation. Handles team name and captain fields with error reporting.",
  "frontend/src/utils/clientCsv.ts": "Utilities for generating, downloading, and parsing CSV files for bulk client uploads with validation. Handles client name, GSTIN, PAN, and notes fields with error reporting.",
  "frontend/src/utils/taskAggregations.ts": "Provides aggregation functions for task data including revenue by category/subcategory, status breakdowns, and comprehensive task statistics calculations. Includes interfaces for aggregated data structures.",
  "frontend/src/utils/taskCsv.ts": "Utilities for generating task CSV templates and parsing uploaded CSV files with comprehensive validation for all task fields including dates, numbers, and status values. Handles quoted fields and provides detailed error reporting.",
  "frontend/src/utils/taskDisplay.ts": "Shared formatting utilities for consistent task data display including date formatting (nanosecond timestamps to readable dates), currency formatting (INR), and placeholder handling for optional fields.",
  "frontend/src/utils/taskExcel.ts": "Exports tasks to Excel format using dynamically loaded SheetJS library from CDN. Converts task data to Excel-friendly format with proper formatting for dates, currency, and optional fields.",
  "frontend/src/utils/taskSort.ts": "Provides task sorting utilities with support for multiple fields (dueDate, status, taskCategory, clientName, assignedName, etc.) and ascending/descending directions, handling null/undefined values by pushing them to the end.",
  "frontend/src/utils/todoCsv.ts": "Handles CSV template generation and parsing for bulk todo upload, including validation and conversion of parsed rows to PartialTodoInput format with proper quote handling.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup functions for managing parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, typography, container queries, animations, and design tokens for a modern UI with dark mode support.",
  "project_state.json": "Project state document (version 67) for a tax consulting task/client management app, tracking architectural decisions, known issues (including persistent blank screen bugs and task edit/add failures), and existing features with Internet Identity authentication."
}