{
  "backend/main.mo": "Main Motoko actor implementing client, task, and assignee CRUD operations with per-user data isolation, access control via MixinAuthorization, and user profile management.",
  "feature_evidence.json": "Feature evidence report documenting completed features including logo replacement, React Query optimization, mutation loading indicators, and sub-category analytics with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing components, pages, hooks, and utilities with focus on new features like sub-category analytics, optimistic updates, and CSWA logo integration.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH-based color system defining light and dark mode CSS variables for UI theming including sidebar, charts, and semantic colors.",
  "frontend/index.html": "HTML entry point with CSWA favicon, viewport meta tag, and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for dashboard, clients, tasks, and assignees, handling authentication state, profile setup modal, and defensive search parameter validation.",
  "frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx": "Dialog component for bulk uploading assignees via CSV with template download, file parsing, validation error display, and submission using useBulkCreateAssignees mutation hook.",
  "frontend/src/components/assignees/AssigneeFormDialog.tsx": "Dialog component for creating, editing, and deleting assignees (teams) with form validation for name and captain fields. Includes confirmation dialog for deletions and uses React Query mutations for backend operations.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name during initial profile setup. Cannot be dismissed and uses the useSaveCallerUserProfile hook to persist the profile.",
  "frontend/src/components/auth/SignedOutScreen.tsx": "Landing page for unauthenticated users featuring CSWA branding, Internet Identity sign-in button, and three feature cards highlighting client management, task tracking, and dashboard insights.",
  "frontend/src/components/clients/ClientBulkUploadDialog.tsx": "Dialog for bulk uploading clients via CSV file with template download, file parsing, validation error display, and preview table. Uses useBulkCreateClients hook to submit parsed data.",
  "frontend/src/components/clients/ClientFormDialog.tsx": "Dialog component for creating, editing, and deleting individual clients with fields for name, GSTIN, PAN, and notes. Includes form validation and delete confirmation dialog.",
  "frontend/src/components/errors/AppStartupErrorBoundary.tsx": "React error boundary component that catches startup errors and displays StartupErrorScreen. Logs errors to console for debugging.",
  "frontend/src/components/errors/StartupErrorScreen.tsx": "Error fallback UI displaying an error icon, message, and reload button when the application fails to start.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with sticky header, navigation sidebar (responsive mobile sheet), user profile dropdown with logout, and navigation links for Dashboard, Clients, Tasks, and Assignees with active state highlighting.",
  "frontend/src/components/tasks/InlineCommentEditor.tsx": "Inline editor component for task comments with edit/save/cancel controls, supporting keyboard shortcuts (Enter to save, Escape to cancel) and hover-to-reveal edit button.",
  "frontend/src/components/tasks/TaskBulkEditDialog.tsx": "Dialog for bulk editing multiple tasks at once, allowing users to update status and other fields for selected tasks while leaving unchanged fields blank.",
  "frontend/src/components/tasks/TaskBulkUploadDialog.tsx": "Dialog for bulk task creation via CSV upload with template download, file parsing, validation error display, and preview table before submission.",
  "frontend/src/components/tasks/TaskDetailsPanel.tsx": "Read-only presentation component displaying all task fields in a mobile-friendly grid layout with formatted dates, currency, and status badges.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Form dialog for creating or editing individual tasks with all fields including dates, financial data, and status selection with validation.",
  "frontend/src/components/tasks/TaskQuickStatus.tsx": "Inline dropdown component for quickly changing a task's status without opening the full edit dialog.",
  "frontend/src/constants/taskStatus.ts": "Single source of truth for allowed task statuses with normalization functions, legacy status mapping (To Do→Pending, Done→Completed, Blocked→Hold), and validation utilities.",
  "frontend/src/hooks/assignees.ts": "Provides React Query hooks for CRUD operations on assignees, including optimistic updates for editing and bulk creation support.",
  "frontend/src/hooks/clients.ts": "Provides React Query hooks for CRUD operations on clients with optimistic updates, managing client data including name, GSTIN, PAN, and notes.",
  "frontend/src/hooks/tasks.ts": "Provides React Query hooks for task management including fetching, creating, and updating tasks with fields like status, assignee, dates, billing, and payment information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current authenticated user's profile, with error handling and authentication state checks.",
  "frontend/src/hooks/useDeferredUrlCleanup.ts": "Captures secret parameters (like caffeineAdminToken) from URL hash, stores them in sessionStorage, and removes them from URL after component mount to prevent router issues.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color palette using warm neutrals, sage green primary, and charcoal tones for both light and dark modes.",
  "frontend/src/lib/dataParser.ts": "Deprecated utility for parsing and encoding client data; now obsolete as Client model stores data directly without encoding.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AssigneesPage.tsx": "Page component for managing assignees (teams/captains) with search, filtering, bulk selection, bulk delete, bulk upload via CSV, and inline editing capabilities.",
  "frontend/src/pages/ClientDetailPage.tsx": "Detail view page for a single client showing client information, task statistics (total/completed/in-progress/pending), and associated tasks with quick status updates.",
  "frontend/src/pages/ClientsPage.tsx": "Page component for managing clients with search by name/GSTIN/PAN, bulk selection, bulk delete, bulk CSV upload, and navigation to client detail pages.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard overview page displaying task statistics, completion rates, upcoming tasks (next 7 days), overdue tasks, and clickable metrics that navigate to filtered task views.",
  "frontend/src/pages/TasksPage.tsx": "Main tasks management page with search, multi-field filtering (status/category/subcategory/overdue), sorting, bulk operations (edit/delete/upload), Excel export, inline editing, and URL-based filter initialization.",
  "frontend/src/utils/assigneeCsv.ts": "Utility functions for assignee CSV operations including template generation/download, CSV parsing with quote handling, validation with error reporting, and conversion to backend format.",
  "frontend/src/utils/clientCsv.ts": "Provides CSV template generation, parsing, and validation utilities for bulk client uploads. Handles CSV line parsing with quote support and converts parsed rows to backend-compatible format.",
  "frontend/src/utils/taskAggregations.ts": "Aggregates task data by category, sub-category, and status to calculate revenue totals, task counts, and status breakdowns. Provides comprehensive statistics for dashboard and reporting views.",
  "frontend/src/utils/taskCsv.ts": "Handles CSV template generation and parsing for bulk task uploads with extensive field support including dates, financial data, and assignments. Validates required fields and converts date strings to bigint timestamps.",
  "frontend/src/utils/taskDisplay.ts": "Provides consistent formatting utilities for task rendering including date formatting, currency display in INR, and placeholder handling for null/undefined values.",
  "frontend/src/utils/taskExcel.ts": "Exports tasks to Excel format using SheetJS library loaded from CDN. Converts task data to Excel-friendly format with proper column widths and triggers file download.",
  "frontend/src/utils/taskSort.ts": "Implements multi-field sorting for tasks with ascending/descending direction support. Handles null/undefined values consistently and provides case-insensitive string comparison.",
  "frontend/src/utils/urlParams.ts": "Manages URL parameter extraction and persistence across navigation using sessionStorage. Supports both regular query strings and hash-based routing, with utilities to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter/Georgia font stacks, custom border radii, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for a tax consulting task/client management app, tracking architectural decisions, known issues (blank screens, task editing failures, slow updates), features, and requirements across 47 versions with Internet Identity authentication."
}