{
  "kind": "build_request",
  "title": "Fix Task edit crash when status is empty string",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-63",
      "text": "Prevent Radix Select crashes in the Task create/edit dialog when a task’s stored status is an empty string (\"\") or otherwise missing/invalid by ensuring the Status <Select> is never controlled with \"\" and always maps empty/whitespace/unknown status values to a safe non-empty sentinel option.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "User: Apply the empty-status fix",
          "User: while try to edit the task ,not working",
          "A Select.Item must have a value prop that is not an empty string."
        ]
      },
      "acceptanceCriteria": [
        "Opening the Edit Task dialog for a task with status === \"\" does not crash and renders the dialog normally.",
        "In frontend/src/components/tasks/TaskFormDialog.tsx, when initializing edit-mode state, empty-string/whitespace status values are mapped to the existing STATUS_NONE_SENTINEL (\"__none__\") instead of being passed through to the Select as \"\".",
        "If an existing task has a status value that is not in ALLOWED_TASK_STATUSES (e.g., legacy or malformed), the dialog does not crash and the status field falls back to the sentinel (\"None\") or a normalized allowed value (if normalization is applied).",
        "Submitting an edited task with the sentinel selected results in sending status: null (i.e., clearing status) rather than sending an empty string.",
        "No SelectItem in the Task edit flow uses value=\"\" and no Select component in the Task edit flow receives \"\" as its controlled value."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead)."
  ],
  "nonGoals": [
    "Changing the backend task schema or writing a data migration to rewrite stored task statuses.",
    "Adding new task status options beyond the existing allowed status set."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}