{
  "kind": "build_request",
  "title": "Fix JavaScript module loading error preventing app from loading",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-104",
      "text": "Fix the JavaScript module loading error 'Failed to load module script: Expected a JavaScript or Wasm module script but the server responded with a MIME type of \"text/html\"' that prevents the application from loading in production by ensuring the build output correctly generates ES module scripts and the server serves them with the correct Content-Type header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "not loading"
        ]
      },
      "acceptanceCriteria": [
        "The application loads successfully in production without JavaScript module errors",
        "The browser console does not show MIME type errors for module scripts",
        "All routes (dashboard, tasks, clients, assignees, todos) render correctly after the fix"
      ]
    },
    {
      "id": "REQ-105",
      "text": "Verify that the frontend build configuration (vite.config.ts or similar) correctly outputs ES modules and that the index.html script tag includes type=\"module\" attribute for the main entry point.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ]
      },
      "acceptanceCriteria": [
        "The main.tsx script is loaded with type=\"module\" attribute",
        "The build process generates valid ES module output",
        "The production bundle loads without module format errors"
      ]
    },
    {
      "id": "REQ-106",
      "text": "Ensure the production server configuration serves JavaScript files with the correct Content-Type header ('application/javascript' or 'text/javascript') instead of 'text/html' for .js and .jsx files.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-final"
        ]
      },
      "acceptanceCriteria": [
        "JavaScript module files are served with Content-Type: application/javascript",
        "No HTML content is returned when requesting JavaScript module files",
        "The browser successfully loads and executes all JavaScript modules"
      ]
    }
  ],
  "constraints": [
    "Do not modify Internet Identity integration hooks (frontend/src/hooks/useInternetIdentity.ts, useInternetIdentity.tsx)",
    "Do not modify frontend/src/hooks/useActor.ts or frontend/src/main.tsx",
    "Do not modify Shadcn UI components in frontend/src/components/ui",
    "Maintain single-actor backend architecture in backend/main.mo"
  ],
  "nonGoals": [
    "Changing the application's core functionality or features",
    "Modifying existing UI components beyond what's needed for the fix",
    "Changing the authentication flow or access control logic",
    "Adding new features or capabilities"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}