{
  "kind": "build_request",
  "title": "Fix Task edit flow and ensure client/assignee-wise task sorting works",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-57",
      "text": "Fix the single-task edit flow so that clicking Edit on a task reliably opens the edit dialog, pre-fills the form with the selected task’s current values, and successfully saves updates via the existing updateTask API (including optional fields like status, comment, assignedName, dates, and amounts).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "edit task is not workimg"
        ]
      },
      "acceptanceCriteria": [
        "From the Tasks page, clicking a task row’s Edit action opens the TaskFormDialog in 'Edit Task' mode (not 'Create New Task').",
        "The edit dialog fields are populated with the existing task values (including optional fields when present).",
        "Submitting the edit dialog calls the updateTask mutation and closes the dialog on success.",
        "After a successful update, the updated values are visible in the Tasks table without requiring a manual page refresh.",
        "If the update fails (e.g., backend trap), a clear error message is shown in the dialog and the dialog remains open."
      ]
    },
    {
      "id": "REQ-58",
      "text": "Ensure task sorting supports both client-wise and assignee-wise sorting in the Tasks page UI and that selecting these sort options actually reorders the visible task table accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "need assignee ,client wise sorting  of task needed"
        ]
      },
      "acceptanceCriteria": [
        "The Tasks page 'Sort by' control includes options for 'Client Name' and 'Assignee'.",
        "When 'Client Name' is selected, the tasks table ordering changes based on clientName (ascending/descending based on the current direction toggle).",
        "When 'Assignee' is selected, the tasks table ordering changes based on assignedName (ascending/descending based on the current direction toggle).",
        "Tasks with missing assignedName do not break sorting and are consistently placed after tasks with an assignedName."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only components must be composed, not modified).",
    "Respect the existing single-actor backend architecture; no new backend services."
  ],
  "nonGoals": [
    "Adding new backend task fields or changing the backend updateTask signature.",
    "Implementing new real-time syncing or WebSocket-based updates.",
    "Adding new authentication providers (Internet Identity remains the only auth method)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}