{
  "kind": "build_request",
  "title": "Optimize bulk update performance to reduce lag during task updates",
  "projectName": "CSWA Group of Companies",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-92",
      "text": "Implement optimistic updates in the useBulkUpdateTasks mutation hook (frontend/src/hooks/tasks.ts) so the UI reflects changes immediately before the server responds, reducing perceived lag during bulk task edits.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "it is very lag while updation ,make it fast all"
        ]
      },
      "acceptanceCriteria": [
        "Bulk task updates show immediate UI feedback before server confirmation",
        "Selected tasks reflect updated values instantly in the task table",
        "Loading indicators show during server processing but don't block UI updates",
        "Failed updates roll back optimistic changes and show clear error messages"
      ]
    },
    {
      "id": "REQ-93",
      "text": "Add immediate visual feedback in TaskBulkEditDialog (frontend/src/components/tasks/TaskBulkEditDialog.tsx) by disabling form controls and showing a spinner on the submit button during mutation submission, preventing multiple clicks and clarifying that the update is processing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "it is very lag while updation"
        ]
      },
      "acceptanceCriteria": [
        "Submit button shows loading spinner and 'Updating...' text during mutation",
        "All form inputs are disabled during submission to prevent editing",
        "Dialog remains open with loading state visible until mutation completes",
        "Success feedback closes dialog and clears bulk selection smoothly"
      ]
    },
    {
      "id": "REQ-94",
      "text": "Optimize the useBulkUpdateTasks mutation's cache invalidation strategy to use precise query keys targeting only the affected task queries, avoiding full task list refetches and reducing network overhead after bulk updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "make it fast all"
        ]
      },
      "acceptanceCriteria": [
        "Mutation onSuccess invalidates only ['tasks'] and individual task queries",
        "No unnecessary refetches of unrelated data (clients, assignees, dashboard)",
        "Task list updates reflect changes without full page reload",
        "Network tab shows minimal requests after bulk update completes"
      ]
    },
    {
      "id": "REQ-95",
      "text": "Review and optimize the backend bulkUpdateTasks implementation in backend/main.mo to ensure it processes updates efficiently, minimizing computational overhead and response time when updating multiple tasks simultaneously.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "it is very lag while updation"
        ]
      },
      "acceptanceCriteria": [
        "Backend bulk update completes within 2 seconds for up to 50 tasks",
        "Motoko code avoids unnecessary iterations or redundant state lookups",
        "Response payload includes only essential data (success status, updated count)",
        "No performance degradation as task count increases in user's dataset"
      ]
    },
    {
      "id": "REQ-96",
      "text": "Add a subtle success toast notification when bulk updates complete successfully, providing clear confirmation without requiring users to verify changes manually in the task list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "Toast appears immediately after successful bulk update",
        "Message clearly states number of tasks updated (e.g., '12 tasks updated successfully')",
        "Toast auto-dismisses after 3 seconds",
        "Toast styling matches existing UI theme and patterns"
      ]
    }
  ],
  "constraints": [
    "Must maintain existing bulk edit dialog UI structure and field layout",
    "Optimistic updates must preserve data integrity and roll back on errors",
    "Backend optimization must not break existing bulkUpdateTasks API contract",
    "All user-facing feedback must remain in English"
  ],
  "nonGoals": [
    "Refactoring the entire React Query setup beyond bulk update mutations",
    "Adding new task fields or changing task data model",
    "Implementing real-time WebSocket updates for collaborative editing",
    "Changing the bulk edit dialog's field selection mechanism"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}