{
  "kind": "build_request",
  "title": "Update Client fields to Name/GSTIN/PAN/Notes and add Clients bulk upload + bulk selection",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Update the backend Client data model and CRUD APIs to use the following fields: Client Name (required), GSTIN (optional), PAN (optional), Notes (optional), replacing the current contactInfo/projects-based client encoding.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "In clients Components\nClient Name, GSTIN(Optional(  ,PAN(Optional),Notes(Optional)"
        ]
      },
      "acceptanceCriteria": [
        "Client type in backend/main.mo includes fields for name (Text), gstin (?Text), pan (?Text), notes (?Text) (or equivalent optional representation).",
        "createClient and updateClient accept the new fields and persist them per-caller, preserving existing access control behavior (trap when unauthenticated).",
        "getClient and getAllClients return the new Client shape."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add backend support for bulk Client operations required by the UI: (1) bulk create clients for the authenticated user from a list of client inputs, and (2) bulk delete clients by a list of client IDs.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add bulk uploand and selection"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a bulkCreateClients API that accepts a list of client inputs (name, gstin?, pan?, notes?) and returns created ClientIds.",
        "Backend exposes a bulkDeleteClients API that accepts a list of ClientIds and deletes those clients for the authenticated user (ignoring missing IDs is acceptable, consistent with bulkDeleteTasks behavior).",
        "All bulk client APIs enforce the same authentication/authorization checks as existing client APIs."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add a conditional Motoko state migration to preserve existing client records by mapping legacy stored client data into the new Client fields (at minimum: map legacy client.name -> new name; set gstin/pan to null; map any legacy notes (currently encoded in contactInfo) into new notes when present).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Client Name, GSTIN(Optional(  ,PAN(Optional),Notes(Optional)"
        ]
      },
      "acceptanceCriteria": [
        "backend/migration.mo is updated/added per the platform’s conditional migration policy to transform existing stable client state into the new model without data loss for client name.",
        "After upgrade, previously created clients still appear in the Clients list.",
        "No migration is performed for fresh deployments without prior state."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Update the frontend client parsing/encoding utilities and all client UI surfaces to reflect the new Client fields: Client Name (required), GSTIN (optional), PAN (optional), Notes (optional). Remove reliance on email/phone/taxYears/status derived from contactInfo/projects.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Client Name, GSTIN(Optional(  ,PAN(Optional),Notes(Optional)"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/lib/dataParser.ts is updated so client parsing no longer expects contactInfo/projects to encode email/phone/taxYears/status; it instead maps to name, gstin, pan, notes.",
        "Client create/edit dialog (frontend/src/components/clients/ClientFormDialog.tsx) shows inputs for Name (required), GSTIN (optional), PAN (optional), Notes (optional), and validation error text is in English.",
        "Clients list page (frontend/src/pages/ClientsPage.tsx) displays sensible columns for the new client fields (at minimum Name, GSTIN, PAN; Notes can be hidden/truncated) and search filters operate on Name and optionally GSTIN/PAN.",
        "Client detail page (frontend/src/pages/ClientDetailPage.tsx) displays GSTIN, PAN, and Notes sections when present."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Implement Clients bulk selection in the Clients list, including: row checkboxes, select-all checkbox, a visible 'X clients selected' bulk action bar, and a bulk delete flow with confirmation dialog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add bulk uploand and selection"
        ]
      },
      "acceptanceCriteria": [
        "Clients list table includes a checkbox column and a select-all checkbox with behavior consistent with the existing Tasks bulk selection UI (frontend/src/pages/TasksPage.tsx).",
        "When one or more clients are selected, a bulk action card/bar appears showing the count selected and at least a 'Delete Selected' action.",
        "Bulk delete prompts for confirmation and, on success, clears selection and refreshes the clients query."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add a Clients bulk upload flow (CSV) that allows downloading a template, uploading a filled CSV, previewing parsed rows, showing validation errors, and committing the upload to create clients in batch.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add bulk uploand and selection"
        ]
      },
      "acceptanceCriteria": [
        "Clients page provides a 'Bulk Upload' button that opens a dialog similar in structure to the existing TaskBulkUploadDialog (download template -> upload CSV -> preview/errors -> submit).",
        "CSV template includes headers for: Client Name (required), GSTIN, PAN, Notes.",
        "CSV parsing validates required Client Name and produces row/column validation errors in English; invalid uploads cannot be submitted.",
        "On successful submit, the dialog shows a success state, closes, and the clients list refreshes to include newly created clients."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add React Query hooks for the new client bulk APIs (bulk create and bulk delete) and wire them into the Clients bulk upload and bulk selection UIs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add bulk uploand and selection"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/hooks/clients.ts includes hooks for bulkCreateClients and bulkDeleteClients (naming consistent with tasks hooks).",
        "Hooks invalidate/refetch the clients list query on success.",
        "UI uses these hooks (no direct actor calls from components other than through hooks)."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: all Motoko logic must remain in backend/main.mo; only use backend/migration.mo for conditional state upgrades.",
    "Do not edit files under frontend/src/components/ui, frontend/src/main.tsx, frontend/src/hooks/useActor.ts, or frontend/src/hooks/useInternetIdentity.ts(x) (immutable paths).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not change the Task model, Tasks bulk upload, or Tasks bulk selection behavior.",
    "Do not add third-party authentication providers or external databases.",
    "Do not implement real-time updates (no websockets/push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}