{
  "kind": "build_request",
  "title": "Remove Client/Assignee dropdowns in Add Task and make fields optional (fix single-task dialog crash)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Update the single Task create/edit dialog to remove the Client and Assignee dropdown (Select) controls, and use free-text inputs only for Client Name and Assigned Name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "remove drop down systrem in client and assignee while add task all are optional"
        ]
      },
      "acceptanceCriteria": [
        "In the Task create/edit dialog (frontend/src/components/tasks/TaskFormDialog.tsx), there is no dropdown/select UI for Client Name.",
        "In the Task create/edit dialog (frontend/src/components/tasks/TaskFormDialog.tsx), there is no dropdown/select UI for Assignee/Assigned Name.",
        "Client Name is editable via a text input only.",
        "Assigned Name is editable via a text input only."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Make all fields optional in the single Task create flow UI (including Client Name, Task Category, and Sub Category) by removing required markers and HTML required validation, while keeping the existing backend API calls functional.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "while add task all are optional"
        ]
      },
      "acceptanceCriteria": [
        "In the Task create dialog UI, Client Name, Task Category, and Sub Category inputs do not show required asterisks and do not enforce HTML 'required' validation.",
        "Submitting the Task create dialog with blank values does not crash the UI; it either successfully creates a task (with empty strings) or shows a clear inline/user-visible error if the backend rejects it.",
        "No changes are made to the Tasks bulk upload flow behavior."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Fix the single Add Task dialog crash caused by Radix Select empty-string values by ensuring no SelectItem uses an empty string value, and by ensuring Select components never receive \"\" as a controlled value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "A <Select.Item /> must have a value prop that is not an empty string."
        ]
      },
      "acceptanceCriteria": [
        "Opening the Create New Task dialog on /tasks no longer shows the error banner: \"A <Select.Item /> must have a value prop that is not an empty string.\"",
        "The Status selector does not render any <SelectItem> with value=\"\" (use a non-empty sentinel value for 'None' or a different UI pattern).",
        "If any Select remains in the Task form (e.g., Status), clearing/unsetting it does not set the Select value to an empty string and does not crash the dialog."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (shadcn/Radix wrappers are read-only).",
    "Keep the backend as a single Motoko actor in backend/main.mo.",
    "Do not introduce new authentication providers; Internet Identity remains the only auth mechanism."
  ],
  "nonGoals": [
    "Changing Tasks bulk upload CSV parsing, validation rules, or template format.",
    "Adding new backend task fields or changing the task persistence schema.",
    "Changing Clients or Assignees list pages beyond what is required to support the Task dialog changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}