{
  "kind": "build_request",
  "title": "Add searchable dropdown/select controls for large lists",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-100",
      "text": "Replace all existing dropdown Select controls for Client Name, Task Category, Task Sub Category, Assigned Name, and Status in the Task create/edit dialog (TaskFormDialog.tsx) with searchable/filterable Select components that support typing to filter/search options when the list is large.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-search-option"
        ],
        "quotes": [
          "search option to select a item from list when it is huge (Task subtype,client etc.)"
        ]
      },
      "acceptanceCriteria": [
        "All dropdown selects in TaskFormDialog support search/filter functionality",
        "Users can type to filter options in Client Name, Task Category, Sub Category, Assigned Name, and Status selects",
        "Search/filter works efficiently with large lists (100+ items)",
        "Filtered results update in real-time as the user types",
        "UI remains consistent with existing Shadcn/Radix Select styling"
      ]
    },
    {
      "id": "REQ-101",
      "text": "Add searchable Select controls in the Tasks page filter controls (TasksPage.tsx) for filtering by Client Name, Task Category, Sub Category, Assigned Name, and Status so users can efficiently find and select filter values from large option lists.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-search-option"
        ]
      },
      "acceptanceCriteria": [
        "All filter dropdowns in TasksPage support search functionality",
        "Users can type to quickly find and select filter values",
        "Search works across Client Name, Category, Sub Category, Assignee, and Status filters",
        "Filter selection remains functional with existing URL-based filter state"
      ]
    },
    {
      "id": "REQ-102",
      "text": "Replace the Client Name selector in the ClientDetailPage task list with a searchable Select component so users can efficiently find and select clients when the client list is large.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-search-option"
        ]
      },
      "acceptanceCriteria": [
        "Client selection in ClientDetailPage supports search/filter",
        "Users can type to filter client options",
        "Selection works correctly with existing client detail navigation"
      ]
    },
    {
      "id": "REQ-103",
      "text": "Ensure all searchable Select implementations use Shadcn/Radix UI components with Combobox pattern or Command component for search functionality, maintaining consistency with the existing UI component library and ensuring accessibility.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-search-option"
        ]
      },
      "acceptanceCriteria": [
        "All searchable selects use consistent Shadcn/Radix UI patterns",
        "Components maintain accessibility standards (keyboard navigation, ARIA attributes)",
        "Visual styling matches existing select components",
        "Search functionality is performant with large option lists (no lag when typing)"
      ]
    }
  ],
  "constraints": [
    "Do not modify immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui",
    "Use only Shadcn UI and Radix UI components for searchable select implementation",
    "Maintain existing form validation and submission logic",
    "Preserve existing filter state management and URL-based filtering"
  ],
  "nonGoals": [
    "Adding search to other entity lists (Assignees, Todos) unless they also have dropdowns with large option sets",
    "Implementing server-side filtering or pagination for dropdown options",
    "Changing the underlying data fetching or storage mechanisms",
    "Adding new filter criteria beyond existing fields"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}