{
  "kind": "build_request",
  "title": "Expand Task fields + add bulk upload and bulk edit/delete",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Update the backend Task data model and APIs to support the Task fields specified by the user: required fields Client Name, Task Category, Sub Category; optional fields Status, Comment, Assigned Name, Due Date, Assignment Date, Completion Date, Bill, Advance Received, Outstanding Amount, Payment Status. Ensure Tasks remain scoped per signed-in principal and maintain existing access control behavior (trap when unauthenticated).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Task compnents are\nClient Name ,Task Category ,Sub Category, Status, Comment, Assigned Name ,Due Date, Assignment Date, Completion Date ,Bill, Advance Received, Outstanding Amount, Payment Status\n\nall field are optional except client name and Task Catogory,Sub Catogory"
        ]
      },
      "acceptanceCriteria": [
        "Backend Task type includes fields covering: clientName (required), taskCategory (required), subCategory (required), status (optional), comment (optional), assignedName (optional), dueDate (optional), assignmentDate (optional), completionDate (optional), bill (optional), advanceReceived (optional), outstandingAmount (optional), paymentStatus (optional).",
        "Create/update task backend methods validate that required fields are non-empty (or trap with a clear error) and allow optional fields to be absent/null.",
        "Existing task listing/query APIs return the new Task shape for all tasks.",
        "All task CRUD remains scoped by caller Principal as it is today (no cross-user data leakage)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add backend support for bulk task operations: (1) bulk create tasks for an authenticated user from a list of task inputs, and (2) bulk delete tasks by a list of task IDs, and (3) bulk update multiple tasks by IDs with a partial 'patch' payload where omitted fields are not changed.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "also add bulk upload using template and bulk seletion to edit or delete"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a bulk create API that accepts an array of task inputs and creates tasks in a single call (returns created IDs and/or per-row success/failure information).",
        "Backend exposes a bulk delete API that accepts an array of task IDs and deletes tasks owned by the caller; attempting to delete a non-existent task returns an error that clearly identifies the failure.",
        "Backend exposes a bulk update API that accepts an array of task IDs and a patch object; only fields present in the patch are updated for each task (required fields are not forced unless being changed).",
        "All bulk operations enforce the same authentication/authorization checks as single-task operations."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add a Tasks bulk upload flow in the frontend: provide a downloadable CSV template that includes columns for all supported task fields, and allow uploading a filled CSV to create tasks in batch. Show a preview and validation errors before committing the upload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "also add bulk upload using template"
        ]
      },
      "acceptanceCriteria": [
        "Tasks page includes an action to download a CSV template with headers matching the task fields (Client Name, Task Category, Sub Category, Status, Comment, Assigned Name, Due Date, Assignment Date, Completion Date, Bill, Advance Received, Outstanding Amount, Payment Status).",
        "User can upload a CSV file; the UI parses it client-side and shows a preview table with row count and any validation errors (at minimum: missing required fields).",
        "Submitting the upload calls the backend bulk create API and refreshes the task list on success.",
        "User-facing text is in English, and error messages clearly indicate which row/column is invalid."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the Tasks UI to match the new Task field set: (1) update the task create/edit form to include required fields Client Name, Task Category, Sub Category and optional fields Status, Comment, Assigned Name, Due Date, Assignment Date, Completion Date, Bill, Advance Received, Outstanding Amount, Payment Status; (2) update the Tasks list table to show the user-specified task components as columns (with sensible responsive behavior, e.g., column hiding on small screens).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Task compnents are\nClient Name ,Task Category ,Sub Category, Status, Comment, Assigned Name ,Due Date, Assignment Date, Completion Date ,Bill, Advance Received, Outstanding Amount, Payment Status"
        ]
      },
      "acceptanceCriteria": [
        "Task create/edit dialog enforces required fields: Client Name, Task Category, Sub Category (cannot submit if missing).",
        "All other fields are optional and can be left blank without blocking save.",
        "Tasks table includes columns for the specified fields; on small screens, less critical columns may be hidden or moved into an 'Details' row/expander, but the data remains accessible.",
        "Existing task quick status editing continues to work with the new data model (or is replaced with an equivalent control) without breaking the page."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Implement bulk selection on the Tasks list and provide bulk actions to edit or delete multiple tasks at once. Bulk edit must allow setting one or more optional fields across selected tasks without overwriting fields the user did not explicitly set in the bulk edit form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "also add bulk seletion to edit or delete"
        ]
      },
      "acceptanceCriteria": [
        "Tasks table includes a selection checkbox per row and a 'select all' checkbox for the current filtered list.",
        "When one or more tasks are selected, the UI shows bulk actions: Delete Selected and Edit Selected.",
        "Delete Selected prompts for confirmation and then deletes the selected tasks; on success the list refreshes and selection clears.",
        "Edit Selected opens a modal/form with optional fields; leaving a field blank means 'do not change this field' for the selected tasks; submitting calls the backend bulk update API and refreshes the list on success."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update frontend parsing/encoding and React Query hooks to align with the new Task model and the new bulk APIs, removing any legacy encoding that stored task metadata inside the description field.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Task compnents are ..."
        ]
      },
      "acceptanceCriteria": [
        "Frontend task types (parser/encoder) represent the new Task fields explicitly (no priority/status encoding inside description).",
        "Existing task create/update/delete hooks work with the updated backend API signatures and payload shapes.",
        "New React Query mutations/hooks exist for bulk create (upload), bulk update, and bulk delete; successful mutations invalidate the tasks query so the list refreshes."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Generate backend/migration.mo only if needed to preserve/upgrade existing persisted state; otherwise do not add it.",
    "Do not modify files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party integrations for file parsing/storage (no external databases, no external storage providers).",
    "Supporting XLSX import/export if it requires adding heavy spreadsheet dependencies; CSV is sufficient unless explicitly requested later.",
    "Changing authentication mechanism (Internet Identity remains the only auth)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}