{
  "kind": "build_request",
  "title": "Enable full field editing in bulk task edit flow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-88",
      "text": "Update the TaskBulkEditDialog component (frontend/src/components/tasks/TaskBulkEditDialog.tsx) to include form fields for all editable Task components: Client Name, Task Category, Sub Category, Status, Comment, Assigned Name, Due Date, Assignment Date, Completion Date, Bill, Advance Received, Outstanding Amount, and Payment Status. Each field must remain optional with an 'Unchanged' sentinel value so users can selectively update only the fields they specify.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "in bulk edit ,i need to update all fields when requires"
        ]
      },
      "acceptanceCriteria": [
        "Bulk edit dialog displays form inputs for all Task fields (Client Name, Task Category, Sub Category, Status, Comment, Assigned Name, Due Date, Assignment Date, Completion Date, Bill, Advance Received, Outstanding Amount, Payment Status)",
        "Each field has a default 'Unchanged' option/value that preserves the existing value when not explicitly set by the user",
        "Form validation handles all field types appropriately (text, dates, numbers, status enum)",
        "User can update any combination of fields across selected tasks without overwriting unchanged fields"
      ]
    },
    {
      "id": "REQ-89",
      "text": "Extend the backend bulkUpdateTasks API (if not already present) or update the existing bulk update logic in backend/main.mo to accept partial updates for all Task fields (clientName, taskCategory, subCategory, status, comment, assignedName, dueDate, assignmentDate, completionDate, bill, advanceReceived, outstandingAmount, paymentStatus). The API must apply only the fields provided in the request payload, leaving omitted fields unchanged in the stored task records.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "in bulk edit ,i need to update all fields when requires"
        ]
      },
      "acceptanceCriteria": [
        "Backend bulk update API accepts optional values for all Task fields",
        "Only explicitly provided fields in the request payload are updated in each task",
        "Omitted/null fields in the request do not overwrite existing stored values",
        "Auto-population logic (assignmentDate when assignedName is set, completionDate when status becomes 'Completed') continues to work during bulk updates"
      ]
    },
    {
      "id": "REQ-90",
      "text": "Update the useBulkUpdateTasks mutation hook in frontend/src/hooks/tasks.ts to send all user-specified field updates from the bulk edit form to the backend bulk update API, properly encoding dates as timestamps and numbers as numeric types. Ensure the mutation triggers appropriate cache invalidation and provides clear loading/success/error feedback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "in bulk edit ,i need to update all fields when requires"
        ]
      },
      "acceptanceCriteria": [
        "Mutation hook sends only the fields the user explicitly set in the bulk edit form",
        "Date fields are converted to backend-expected timestamp format (Int nanoseconds)",
        "Numeric fields (Bill, Advance Received, Outstanding Amount) are sent as numbers",
        "Cache invalidation updates the Tasks list immediately after successful bulk update",
        "Loading and error states are properly handled and displayed to the user"
      ]
    },
    {
      "id": "REQ-91",
      "text": "Wire the expanded TaskBulkEditDialog form submission to call the updated useBulkUpdateTasks mutation with all user-provided field values, ensuring the bulk edit flow remains consistent with existing UI patterns (dialog closure on success, error display, bulk selection state clearing after successful update).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "in bulk edit ,i need to update all fields when requires"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the bulk edit form updates only the selected tasks with the specified field changes",
        "Dialog closes automatically after successful update",
        "Bulk selection checkboxes are cleared after successful update",
        "Success/error feedback is displayed to the user in English",
        "Updated tasks reflect the new values immediately in the Tasks list table"
      ]
    }
  ],
  "constraints": [
    "Do not modify the backend single-actor architecture",
    "Do not edit files listed in frontend.immutablePaths (useInternetIdentity.ts, useActor.ts, main.tsx, frontend/src/components/ui/*)",
    "Preserve backward compatibility with existing stored task data",
    "Maintain the 'Unchanged' sentinel value pattern for selective field updates"
  ],
  "nonGoals": [
    "Adding new task fields beyond those already supported",
    "Changing the bulk selection UI or checkbox behavior",
    "Modifying single-task edit dialog functionality",
    "Altering the tasks list table column display"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}