{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make single Task dialog free-text only, optional fields, and fix Radix Select empty-string crash",
  "requirements": [
    {
      "id": "REQ-41",
      "summary": "Remove Client and Assignee dropdowns from the single Task create/edit dialog and use free-text inputs only.",
      "acceptanceCriteria": [
        "In the Task create/edit dialog (frontend/src/components/tasks/TaskFormDialog.tsx), there is no dropdown/select UI for Client Name.",
        "In the Task create/edit dialog (frontend/src/components/tasks/TaskFormDialog.tsx), there is no dropdown/select UI for Assignee/Assigned Name.",
        "Client Name is editable via a text input only.",
        "Assigned Name is editable via a text input only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tasks/TaskFormDialog.tsx",
          "operation": "modify",
          "description": "Remove the Client Name and Assignee Select controls and related data-loading hooks (useGetAllClients/useGetAllAssignees) from the Task dialog UI, leaving only <Input> fields for clientName and assignedName. Ensure no orphaned imports remain and the dialog layout remains usable."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Make all fields optional in the single Task create flow UI and prevent crashes on blank submission while keeping backend calls working.",
      "acceptanceCriteria": [
        "In the Task create dialog UI, Client Name, Task Category, and Sub Category inputs do not show required asterisks and do not enforce HTML 'required' validation.",
        "Submitting the Task create dialog with blank values does not crash the UI; it either successfully creates a task (with empty strings) or shows a clear inline/user-visible error if the backend rejects it.",
        "No changes are made to the Tasks bulk upload flow behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tasks/TaskFormDialog.tsx",
          "operation": "modify",
          "description": "Remove required asterisks and HTML required validation from Client Name, Task Category, and Sub Category. Ensure submit uses safe defaults (e.g., empty strings) so the backend call remains functional. Add a dialog-local, user-visible error state for failed create/update mutations to prevent any UI crash when backend rejects blank values."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Fix Add Task dialog crash by eliminating empty-string values in Radix Select items and controlled values (e.g., Status).",
      "acceptanceCriteria": [
        "Opening the Create New Task dialog on /tasks no longer shows the error banner: \"A <Select.Item /> must have a value prop that is not an empty string.\"",
        "The Status selector does not render any <SelectItem> with value=\"\" (use a non-empty sentinel value for 'None' or a different UI pattern).",
        "If any Select remains in the Task form (e.g., Status), clearing/unsetting it does not set the Select value to an empty string and does not crash the dialog."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tasks/TaskFormDialog.tsx",
          "operation": "modify",
          "description": "Update any remaining Select usage in the Task dialog (notably Status) to use a non-empty sentinel value for the 'None' option and ensure the controlled Select value is never \"\". Map the sentinel to null when calling updateTask, and ensure initialization/reset paths also avoid \"\" to prevent Radix Select runtime errors."
        }
      ]
    }
  ]
}