{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add assignee-wise sorting to Tasks list",
  "requirements": [
    {
      "id": "REQ-52",
      "summary": "Add an assignee-wise sort option to the Tasks page and implement client-side sorting by Task.assignedName while preserving existing sort behavior.",
      "acceptanceCriteria": [
        "In frontend/src/utils/taskSort.ts, the SortField union includes an assignee sort field (e.g., \"assignedName\") and SORT_FIELD_LABELS includes an English label for it.",
        "In frontend/src/utils/taskSort.ts, sortTasks() can sort by assignedName using the existing null-safe, case-insensitive string comparison behavior (tasks with missing/empty assignedName sort to the end).",
        "In frontend/src/pages/TasksPage.tsx, the \"Sort by\" Select includes an option for the new assignee sort field, and selecting it updates the rendered task ordering accordingly.",
        "Existing sort options (Due Date, Status, Task Category, Client Name, Bill Amount, Created At) continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/taskSort.ts",
          "operation": "modify",
          "description": "Extend SortField to include an assignee sort field (\"assignedName\"), add its label to SORT_FIELD_LABELS, and update sortTasks() to support sorting by Task.assignedName using the existing null-safe, case-insensitive string comparison (ensuring missing/empty assignedName values sort to the end). Keep all sorting client-side and do not introduce backend changes."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Add the new assignee sort option to the existing \"Sort by\" Select (without modifying any files under frontend/src/components/ui) and ensure selecting it updates sortField so the rendered task table order changes accordingly via the existing sortTasks(filteredTasks, sortField, sortDirection) flow. Preserve all existing sort options and their behavior."
        }
      ]
    }
  ]
}