{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auto-populate Assignment Date and Completion Date based on task state changes",
  "requirements": [
    {
      "id": "REQ-87",
      "summary": "Update frontend task mutation hooks and UI flows to send complete task payloads for backend auto-population of assignmentDate and completionDate",
      "acceptanceCriteria": [
        "All task update mutations send the complete task payload including current values for assignedName and status",
        "The backend receives sufficient context to detect assignedName transitions (null → non-empty) and status transitions (→ 'Completed')",
        "No existing task update flows are broken by these changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Update useUpdateTask hook to ensure all task update mutations send the complete existing task data as the baseline. When updating specific fields, merge the updates with all current task field values so the backend receives full context to detect state transitions for assignedName (null/empty → non-empty) and status (→ 'Completed'). Preserve the existing optimistic update logic and query invalidation behavior."
        },
        {
          "path": "frontend/src/components/tasks/TaskFormDialog.tsx",
          "operation": "modify",
          "description": "Update the task update mutation call to pass all current task field values when submitting the form. Ensure that when editing an existing task, all fields (including assignedName, status, assignmentDate, completionDate) are sent to the backend even if unchanged, providing the backend with complete context for auto-population logic."
        },
        {
          "path": "frontend/src/components/tasks/TaskQuickStatus.tsx",
          "operation": "modify",
          "description": "Verify that the status update mutation already sends all existing task fields alongside the new status value. Ensure the complete task object is provided to the backend so it can detect status transitions to 'Completed' and auto-populate completionDate."
        },
        {
          "path": "frontend/src/components/tasks/InlineCommentEditor.tsx",
          "operation": "modify",
          "description": "Update the comment update mutation to send all existing task field values along with the new comment. Ensure the backend receives complete task context including current assignedName and status values, even though this component only modifies the comment field."
        },
        {
          "path": "frontend/src/components/tasks/TaskBulkEditDialog.tsx",
          "operation": "modify",
          "description": "Update bulk edit logic to ensure each task being updated sends its complete existing field values merged with the bulk edit changes. For fields using the unchanged sentinel value, preserve the existing task values so the backend receives full context for all tasks being updated."
        }
      ]
    }
  ]
}