{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Clients UI fields and add bulk upload + bulk selection",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Update client parsing/encoding and all client UI surfaces to use Name/GSTIN/PAN/Notes only.",
      "acceptanceCriteria": [
        "frontend/src/lib/dataParser.ts is updated so client parsing no longer expects contactInfo/projects to encode email/phone/taxYears/status; it instead maps to name, gstin, pan, notes.",
        "Client create/edit dialog (frontend/src/components/clients/ClientFormDialog.tsx) shows inputs for Name (required), GSTIN (optional), PAN (optional), Notes (optional), and validation error text is in English.",
        "Clients list page (frontend/src/pages/ClientsPage.tsx) displays sensible columns for the new client fields (at minimum Name, GSTIN, PAN; Notes can be hidden/truncated) and search filters operate on Name and optionally GSTIN/PAN.",
        "Client detail page (frontend/src/pages/ClientDetailPage.tsx) displays GSTIN, PAN, and Notes sections when present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/dataParser.ts",
          "operation": "modify",
          "description": "Replace legacy client parsing/encoding (contactInfo/projects-derived email/phone/taxYears/status) with a new ParsedClient shape mapping directly to backend Client fields: name, gstin?, pan?, notes?. Remove encodeClientData if no longer needed, and update exports accordingly."
        },
        {
          "path": "frontend/src/components/clients/ClientFormDialog.tsx",
          "operation": "modify",
          "description": "Update the client create/edit/delete dialog to capture and validate the new fields: Name (required), GSTIN (optional), PAN (optional), Notes (optional). Remove email/phone/taxYears/status UI and any reliance on encodeClientData/parseClientData legacy fields. Ensure all user-facing validation/errors remain in English."
        },
        {
          "path": "frontend/src/pages/ClientsPage.tsx",
          "operation": "modify",
          "description": "Update the Clients list UI to display columns aligned with the new client model (e.g., Name, GSTIN, PAN; optionally show Notes truncated). Remove status filter UI and any email-based search logic; update search to filter by Name and optionally GSTIN/PAN/Notes."
        },
        {
          "path": "frontend/src/pages/ClientDetailPage.tsx",
          "operation": "modify",
          "description": "Update the client detail view to remove contact/tax-year/status UI and instead render sections/rows for GSTIN, PAN, and Notes when present, while keeping the client name as the primary heading."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Implement Clients bulk selection in the Clients list with select-all, selection count bar, and bulk delete confirmation.",
      "acceptanceCriteria": [
        "Clients list table includes a checkbox column and a select-all checkbox with behavior consistent with the existing Tasks bulk selection UI (frontend/src/pages/TasksPage.tsx).",
        "When one or more clients are selected, a bulk action card/bar appears showing the count selected and at least a 'Delete Selected' action.",
        "Bulk delete prompts for confirmation and, on success, clears selection and refreshes the clients query."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ClientsPage.tsx",
          "operation": "modify",
          "description": "Add bulk selection state and UI to the Clients table: row checkboxes, a select-all checkbox, and a visible bulk action bar showing 'X clients selected' and a 'Delete Selected' action. Mirror selection patterns from frontend/src/pages/TasksPage.tsx (without changing tasks behavior). Wire bulk delete to the clients bulk delete hook and include a confirmation dialog; on success clear selection and rely on query invalidation/refresh."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add Clients CSV bulk upload dialog with template download, upload/preview, validation errors, and batch create submit.",
      "acceptanceCriteria": [
        "Clients page provides a 'Bulk Upload' button that opens a dialog similar in structure to the existing TaskBulkUploadDialog (download template -> upload CSV -> preview/errors -> submit).",
        "CSV template includes headers for: Client Name (required), GSTIN, PAN, Notes.",
        "CSV parsing validates required Client Name and produces row/column validation errors in English; invalid uploads cannot be submitted.",
        "On successful submit, the dialog shows a success state, closes, and the clients list refreshes to include newly created clients."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/clientCsv.ts",
          "operation": "create",
          "description": "Create CSV utilities for Clients bulk upload: generate/download template with headers (Client Name, GSTIN, PAN, Notes), parse CSV rows (including quoted fields), and validate that Client Name is present per row. Return parsed rows plus English row/column validation errors, and provide a conversion helper to the backend bulk-create input shape."
        },
        {
          "path": "frontend/src/components/clients/ClientBulkUploadDialog.tsx",
          "operation": "create",
          "description": "Implement a Clients bulk upload dialog modeled after frontend/src/components/tasks/TaskBulkUploadDialog.tsx: Step 1 download template, Step 2 upload CSV, show parsed preview table, show validation errors (English), and submit using the bulkCreateClients hook. Include a success state and auto-close/reset behavior, and ensure submit is disabled when invalid."
        },
        {
          "path": "frontend/src/pages/ClientsPage.tsx",
          "operation": "modify",
          "description": "Add a 'Bulk Upload' button to open the new ClientBulkUploadDialog, manage its open/close state, and ensure successful uploads result in the clients list reflecting new entries via React Query invalidation/refetch."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add React Query hooks for clients bulk create/delete and wire them into bulk upload and bulk selection UIs.",
      "acceptanceCriteria": [
        "frontend/src/hooks/clients.ts includes hooks for bulkCreateClients and bulkDeleteClients (naming consistent with tasks hooks).",
        "Hooks invalidate/refetch the clients list query on success.",
        "UI uses these hooks (no direct actor calls from components other than through hooks)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/clients.ts",
          "operation": "modify",
          "description": "Add React Query mutation hooks for bulkCreateClients and bulkDeleteClients using the backend actor (consistent patterns with frontend/src/hooks/tasks.ts). Ensure onSuccess invalidates the ['clients'] query and, where relevant, any per-client queries. Update existing create/update hooks to use the new backend client input shape (name, gstin?, pan?, notes?) instead of legacy contactInfo/projects arguments."
        },
        {
          "path": "frontend/src/pages/ClientsPage.tsx",
          "operation": "modify",
          "description": "Wire the bulk selection delete flow to use the new useBulkDeleteClients hook (no direct actor calls). Ensure successful deletion clears selection and relies on hook invalidation/refetch to update the list."
        },
        {
          "path": "frontend/src/components/clients/ClientBulkUploadDialog.tsx",
          "operation": "modify",
          "description": "Wire the upload submit action to use the new useBulkCreateClients hook (no direct actor calls). Ensure success triggers UI success state and close/reset flow, and that the clients list refreshes via hook invalidation."
        }
      ]
    }
  ]
}