{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Optimize bulk update performance to reduce lag during task updates",
  "requirements": [
    {
      "id": "REQ-92",
      "summary": "Implement optimistic updates in useBulkUpdateTasks mutation hook to show immediate UI feedback before server response",
      "acceptanceCriteria": [
        "Bulk task updates show immediate UI feedback before server confirmation",
        "Selected tasks reflect updated values instantly in the task table",
        "Loading indicators show during server processing but don't block UI updates",
        "Failed updates roll back optimistic changes and show clear error messages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Add optimistic update logic to the useBulkUpdateTasks mutation by implementing an onMutate callback that updates the React Query cache immediately with the new task values before the server responds. Store the previous state for rollback on error. In onError, restore the previous cache state and display an error toast. Ensure the optimistic updates correctly merge partial task changes with existing task data from the cache."
        }
      ]
    },
    {
      "id": "REQ-93",
      "summary": "Add immediate visual feedback in TaskBulkEditDialog with loading states during mutation submission",
      "acceptanceCriteria": [
        "Submit button shows loading spinner and 'Updating...' text during mutation",
        "All form inputs are disabled during submission to prevent editing",
        "Dialog remains open with loading state visible until mutation completes",
        "Success feedback closes dialog and clears bulk selection smoothly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tasks/TaskBulkEditDialog.tsx",
          "operation": "modify",
          "description": "Extract the isPending state from the useBulkUpdateTasks mutation hook and use it to disable all form inputs and the submit button during submission. Update the submit button to show a loading spinner icon and 'Updating...' text when isPending is true. Ensure the dialog remains open with the loading state visible until the mutation completes successfully or fails."
        }
      ]
    },
    {
      "id": "REQ-94",
      "summary": "Optimize cache invalidation strategy to use precise query keys and avoid unnecessary refetches",
      "acceptanceCriteria": [
        "Mutation onSuccess invalidates only ['tasks'] and individual task queries",
        "No unnecessary refetches of unrelated data (clients, assignees, dashboard)",
        "Task list updates reflect changes without full page reload",
        "Network tab shows minimal requests after bulk update completes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Refine the onSuccess callback in useBulkUpdateTasks to invalidate only the ['tasks'] query key (which covers getAllTasksWithCaptain) and individual task query keys ['task', taskId] for each updated task. Remove any broad invalidations that might trigger unnecessary refetches of clients, assignees, or dashboard data. Ensure the cache invalidation is precise and targeted to minimize network overhead."
        }
      ]
    },
    {
      "id": "REQ-96",
      "summary": "Add success toast notification when bulk updates complete successfully",
      "acceptanceCriteria": [
        "Toast appears immediately after successful bulk update",
        "Message clearly states number of tasks updated (e.g., '12 tasks updated successfully')",
        "Toast auto-dismisses after 3 seconds",
        "Toast styling matches existing UI theme and patterns"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Import and use the toast utility (likely from shadcn/ui) in the useBulkUpdateTasks mutation's onSuccess callback. Display a success toast with a message like '{count} tasks updated successfully' where count is the number of tasks updated. Configure the toast to auto-dismiss after 3 seconds. Ensure the toast styling matches the existing UI theme."
        },
        {
          "path": "frontend/src/components/tasks/TaskBulkEditDialog.tsx",
          "operation": "modify",
          "description": "After successful mutation completion, close the dialog smoothly and ensure any bulk selection state is cleared in the parent component (TasksPage). Coordinate with the toast notification from the mutation hook to provide seamless feedback to the user."
        }
      ]
    }
  ]
}