{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Tasks edit dialog flow and client/assignee sorting",
  "requirements": [
    {
      "id": "REQ-57",
      "summary": "Make single-task Edit reliably open TaskFormDialog in edit mode, prefill values, and persist updates through updateTask with good success/error UX.",
      "acceptanceCriteria": [
        "From the Tasks page, clicking a task row’s Edit action opens the TaskFormDialog in 'Edit Task' mode (not 'Create New Task').",
        "The edit dialog fields are populated with the existing task values (including optional fields when present).",
        "Submitting the edit dialog calls the updateTask mutation and closes the dialog on success.",
        "After a successful update, the updated values are visible in the Tasks table without requiring a manual page refresh.",
        "If the update fails (e.g., backend trap), a clear error message is shown in the dialog and the dialog remains open."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Fix dialog wiring so Edit always opens TaskFormDialog with the selected task bound (pass task={editingTask}), and ensure Add Task explicitly clears any previous editingTask before opening. Use a single onOpenChange handler that clears editingTask on close to prevent stale state causing 'Create New Task' mode or incorrect prefills."
        },
        {
          "path": "frontend/src/components/tasks/TaskFormDialog.tsx",
          "operation": "modify",
          "description": "Harden edit-mode form initialization and submission: ensure the form always re-initializes from the provided task when opening for edit (including optional fields like status/comment/assignedName/dates/amounts), and improve in-dialog error rendering so backend failures produce a clear message while keeping the dialog open."
        },
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Ensure the updateTask mutation reliably refreshes the Tasks table after a successful update by keeping React Query cache invalidation/refetch behavior consistent for both the tasks list and the edited task detail query."
        }
      ]
    },
    {
      "id": "REQ-58",
      "summary": "Ensure Tasks page sorting supports client-wise and assignee-wise ordering and visibly reorders the table, handling missing assignees consistently.",
      "acceptanceCriteria": [
        "The Tasks page 'Sort by' control includes options for 'Client Name' and 'Assignee'.",
        "When 'Client Name' is selected, the tasks table ordering changes based on clientName (ascending/descending based on the current direction toggle).",
        "When 'Assignee' is selected, the tasks table ordering changes based on assignedName (ascending/descending based on the current direction toggle).",
        "Tasks with missing assignedName do not break sorting and are consistently placed after tasks with an assignedName."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/taskSort.ts",
          "operation": "modify",
          "description": "Adjust assignee sorting to treat empty-string assignedName values as missing (in addition to null/undefined) so they sort consistently after real assignees in both directions, without breaking comparisons."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Verify the 'Sort by' control is wired to the SortField values used by sortTasks for both 'Client Name' (clientName) and 'Assignee' (assignedName), so changing the selection triggers a visible reorder of the rendered task rows."
        }
      ]
    }
  ]
}