{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Completion Date auto-population when marking tasks as Completed",
  "requirements": [
    {
      "id": "REQ-98",
      "summary": "Verify frontend task update mutations send complete task payloads including status field",
      "acceptanceCriteria": [
        "All task update API calls include the status field in the request payload",
        "The backend receives accurate status values to determine when a transition to 'Completed' occurs",
        "No frontend validation or encoding errors prevent the status from being sent correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Review and verify that useUpdateTask mutation includes the status field in all update calls. Ensure the mutation properly passes the status value from TaskFormDialog, TaskQuickStatus, and TaskBulkEditDialog components. Confirm that useBulkUpdateTasks sends status for each task in the updates array. Add explicit status field handling if missing to ensure backend receives complete payloads for detecting status transitions to 'Completed'."
        },
        {
          "path": "frontend/src/components/tasks/TaskFormDialog.tsx",
          "operation": "modify",
          "description": "Verify that the form submission includes the current status value in the update payload sent to useUpdateTask. Ensure status is not accidentally omitted when other fields are updated. Confirm form state properly tracks status changes and passes them to the mutation."
        },
        {
          "path": "frontend/src/components/tasks/TaskQuickStatus.tsx",
          "operation": "modify",
          "description": "Verify that the quick status change component sends the complete task payload with the new status value to the update mutation. Ensure all existing task fields are preserved when updating only the status field."
        },
        {
          "path": "frontend/src/components/tasks/TaskBulkEditDialog.tsx",
          "operation": "modify",
          "description": "Verify that bulk edit operations include status in the PartialTaskUpdate objects for tasks being updated. Ensure the unchanged sentinel pattern properly handles status field updates and that status values are sent to useBulkUpdateTasks for all tasks where status is being changed."
        }
      ]
    },
    {
      "id": "REQ-99",
      "summary": "Add defensive date validation in frontend task display utilities for completionDate timestamps",
      "acceptanceCriteria": [
        "The formatDate utility handles null/undefined timestamps gracefully (displays '—' or empty)",
        "Invalid or malformed timestamps do not cause 'Invalid Date' to appear in the UI",
        "Completion Date column in the Tasks table displays valid dates for all completed tasks",
        "Task detail views (TaskDetailsPanel, ClientDetailPage task lists) show valid completion dates"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/taskDisplay.ts",
          "operation": "modify",
          "description": "Add defensive validation to the formatDate utility function to handle edge cases: check for null/undefined timestamps and return '—'; validate that timestamp is a valid number within the valid Date range (not NaN, Infinity, or outside JavaScript Date bounds); detect timestamps that produce 'Invalid Date' when converted and return '—' instead. Ensure completionDate timestamps from the backend (bigint nanoseconds) are properly converted to milliseconds and validated before creating Date objects. Add unit test coverage for edge cases including null, undefined, 0, negative values, extremely large values, and invalid timestamp formats."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Verify that the Completion Date column uses the updated formatDate utility from taskDisplay.ts. Ensure the column properly handles cases where completionDate is null, undefined, or invalid. Test that 'Invalid Date' no longer appears in the UI for completed tasks."
        },
        {
          "path": "frontend/src/components/tasks/TaskDetailsPanel.tsx",
          "operation": "modify",
          "description": "Verify that completionDate display in the task details panel uses the updated formatDate utility. Ensure invalid dates show as '—' instead of 'Invalid Date'. Confirm the panel gracefully handles null/undefined completionDate values."
        },
        {
          "path": "frontend/src/pages/ClientDetailPage.tsx",
          "operation": "modify",
          "description": "Verify that task lists shown on client detail pages use the updated formatDate utility for completionDate display. Ensure consistency with TasksPage and TaskDetailsPanel in handling invalid dates."
        }
      ]
    }
  ]
}