{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Expand Tasks UI for new fields + bulk upload and bulk edit/delete",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Add a CSV template download + CSV upload preview/validation flow to bulk-create tasks.",
      "acceptanceCriteria": [
        "Tasks page includes an action to download a CSV template with headers matching the task fields (Client Name, Task Category, Sub Category, Status, Comment, Assigned Name, Due Date, Assignment Date, Completion Date, Bill, Advance Received, Outstanding Amount, Payment Status).",
        "User can upload a CSV file; the UI parses it client-side and shows a preview table with row count and any validation errors (at minimum: missing required fields).",
        "Submitting the upload calls the backend bulk create API and refreshes the task list on success.",
        "User-facing text is in English, and error messages clearly indicate which row/column is invalid."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/taskCsv.ts",
          "operation": "create",
          "description": "Implement CSV template generation (headers for all supported Task fields) and lightweight CSV parsing + row-level validation helpers (at minimum required fields present) used by the bulk upload UI. Ensure English error messages include row/column context."
        },
        {
          "path": "frontend/src/components/tasks/TaskBulkUploadDialog.tsx",
          "operation": "create",
          "description": "Create a Tasks bulk upload dialog: download template action, file input for CSV upload, client-side parse/validation, and a preview table summarizing row count and validation errors before allowing submit. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Add a visible bulk upload action on the Tasks page that opens the new TaskBulkUploadDialog, and refreshes tasks on successful upload. Keep all user-facing text in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Add a React Query mutation/hook for bulk create that calls the backend bulkCreateTasks capability and invalidates the ['tasks'] query on success (so the list refreshes)."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Update Tasks create/edit dialog and Tasks table to use the new Task field set with responsive columns.",
      "acceptanceCriteria": [
        "Task create/edit dialog enforces required fields: Client Name, Task Category, Sub Category (cannot submit if missing).",
        "All other fields are optional and can be left blank without blocking save.",
        "Tasks table includes columns for the specified fields; on small screens, less critical columns may be hidden or moved into an 'Details' row/expander, but the data remains accessible.",
        "Existing task quick status editing continues to work with the new data model (or is replaced with an equivalent control) without breaking the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tasks/TaskFormDialog.tsx",
          "operation": "modify",
          "description": "Replace the legacy task form fields (title/description/clientId/priority/deadline) with the new Task fields: required Client Name, Task Category, Sub Category; optional Status, Comment, Assigned Name, Due Date, Assignment Date, Completion Date, Bill, Advance Received, Outstanding Amount, Payment Status. Enforce required fields before submit; encode optional blanks as null/undefined as expected by hooks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/tasks/TaskQuickStatus.tsx",
          "operation": "modify",
          "description": "Update quick status editing to work with the new Task model/update mutation (ensure it updates status without breaking other fields). If the new update flow requires more context, pass the needed task fields through and keep the UI behavior equivalent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Update Tasks table columns to match the specified Task fields (Client Name, Task Category, Sub Category, Status, Comment, Assigned Name, Due Date, Assignment Date, Completion Date, Bill, Advance Received, Outstanding Amount, Payment Status) with sensible responsive behavior (e.g., hide less critical columns on small screens and provide an accessible details/expander row). Remove legacy title/priority/description/client mapping logic. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/dataParser.ts",
          "operation": "modify",
          "description": "Update task parsing/representation helpers to reflect the new Task fields explicitly (no decoding from a compact description/status format). Keep client parsing as-is. Ensure any date/number normalization used by UI is consistent (e.g., bigint dates displayed as locale dates)."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add bulk selection on Tasks list plus bulk delete and bulk edit (patch-style) actions.",
      "acceptanceCriteria": [
        "Tasks table includes a selection checkbox per row and a 'select all' checkbox for the current filtered list.",
        "When one or more tasks are selected, the UI shows bulk actions: Delete Selected and Edit Selected.",
        "Delete Selected prompts for confirmation and then deletes the selected tasks; on success the list refreshes and selection clears.",
        "Edit Selected opens a modal/form with optional fields; leaving a field blank means 'do not change this field' for the selected tasks; submitting calls the backend bulk update API and refreshes the list on success."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/tasks/TaskBulkEditDialog.tsx",
          "operation": "create",
          "description": "Create a bulk edit dialog that lets the user set one or more optional fields across selected tasks. Leaving a field unset must mean 'do not change'. On submit, call the bulk update hook and close on success. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Add row selection checkboxes + select-all for the currently filtered list, show bulk action buttons (Delete Selected, Edit Selected) when selection is non-empty, and wire to confirmation + dialogs. Ensure selection clears and tasks refetch after successful bulk operations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Add React Query mutations/hooks for bulk delete and bulk update that call the backend bulkDeleteTasks and bulkUpdateTasks capabilities, and invalidate the ['tasks'] query on success."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Align frontend types/parsing and React Query hooks with the new Task model and new bulk APIs; remove legacy encoding.",
      "acceptanceCriteria": [
        "Frontend task types (parser/encoder) represent the new Task fields explicitly (no priority/status encoding inside description).",
        "Existing task create/update/delete hooks work with the updated backend API signatures and payload shapes.",
        "New React Query mutations/hooks exist for bulk create (upload), bulk update, and bulk delete; successful mutations invalidate the tasks query so the list refreshes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/dataParser.ts",
          "operation": "modify",
          "description": "Remove legacy task encoding/decoding that stored metadata in the description field; update ParsedTask (or equivalent) to mirror the backend Task shape and keep conversions minimal and explicit."
        },
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Update existing task hooks (get/create/update/delete) to match the current backend function signatures and Task type shape from frontend/src/backend.d.ts. Add bulk create/update/delete hooks (or refactor into a consistent API) and ensure all successful mutations invalidate tasks queries for refresh."
        },
        {
          "path": "frontend/src/components/tasks/TaskFormDialog.tsx",
          "operation": "modify",
          "description": "Update create/edit/delete wiring to use the updated hooks and data shapes (no legacy encoded description/status/priority behavior). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Update Tasks page filtering/search logic to use the new Task fields (e.g., search across Client Name/Category/Sub Category/Assigned Name/Comment) and remove legacy references to title/description/priority/clientId/deadline while preserving equivalent UX where possible. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}