{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Todo List Feature and Display Captain Name in Task Views",
  "requirements": [
    {
      "id": "REQ-81",
      "summary": "Add Todo List management feature with full CRUD operations scoped per authenticated user",
      "acceptanceCriteria": [
        "Frontend adds React Query hooks for todo CRUD operations following patterns in frontend/src/hooks/tasks.ts and frontend/src/hooks/clients.ts",
        "Frontend adds a Todos page/section accessible via navigation",
        "UI includes todo list view, add/edit forms, and delete confirmation",
        "UI follows existing design system (Tailwind, Shadcn components, CSWA theme)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/todos.ts",
          "operation": "create",
          "description": "Create React Query hooks for todo CRUD operations (useGetAllTodos, useGetTodo, useCreateTodo, useUpdateTodo, useDeleteTodo, useBulkCreateTodos, useBulkDeleteTodos) following the same patterns used in frontend/src/hooks/tasks.ts and frontend/src/hooks/clients.ts. Include optimistic updates for mutations and proper cache invalidation."
        },
        {
          "path": "frontend/src/pages/TodosPage.tsx",
          "operation": "create",
          "description": "Create the main Todos page component with todo list view, search functionality, filtering by completion status, add/edit dialogs, and delete confirmation. Follow the layout and patterns used in frontend/src/pages/TasksPage.tsx and frontend/src/pages/ClientsPage.tsx. Include bulk selection checkboxes and bulk operations toolbar."
        },
        {
          "path": "frontend/src/components/todos/TodoFormDialog.tsx",
          "operation": "create",
          "description": "Create form dialog component for creating and editing individual todos with fields for title (required), description (optional), completed (boolean checkbox), priority (optional number), and dueDate (optional date picker). Follow patterns from frontend/src/components/tasks/TaskFormDialog.tsx and frontend/src/components/clients/ClientFormDialog.tsx. Include delete confirmation dialog for edit mode."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route configuration for the Todos page at path '/todos' in the TanStack Router setup. Follow the existing route patterns for clients, tasks, and assignees."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add navigation link for Todos in the sidebar navigation menu. Insert it after the Assignees link. Include active state highlighting using the same pattern as existing navigation links."
        }
      ]
    },
    {
      "id": "REQ-82",
      "summary": "Add bulk operations support for Todos including CSV upload and bulk delete",
      "acceptanceCriteria": [
        "Frontend adds CSV template generator and parser for todos in frontend/src/utils/todoCsv.ts",
        "Frontend adds TodoBulkUploadDialog component with template download, CSV upload, preview, validation, and commit flow",
        "Frontend adds bulk selection checkboxes in todo list with bulk delete action",
        "All bulk operations show clear loading, validation error, and success feedback"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/todoCsv.ts",
          "operation": "create",
          "description": "Create CSV utility functions for todos including generateTodoCsvTemplate (generates and downloads CSV template with headers: Title, Description, Completed, Priority, Due Date), parseTodoCsv (parses uploaded CSV with quote handling and whitespace trimming), validateTodoRow (validates required title field and formats), and convertToTodoInput (converts parsed rows to PartialTodoInput format). Follow patterns from frontend/src/utils/clientCsv.ts and frontend/src/utils/assigneeCsv.ts."
        },
        {
          "path": "frontend/src/components/todos/TodoBulkUploadDialog.tsx",
          "operation": "create",
          "description": "Create bulk upload dialog component for todos with CSV template download button, file input with drag-and-drop support, preview table showing parsed todos with validation errors highlighted, and commit button using useBulkCreateTodos hook. Follow the patterns from frontend/src/components/clients/ClientBulkUploadDialog.tsx and frontend/src/components/assignees/AssigneeBulkUploadDialog.tsx."
        },
        {
          "path": "frontend/src/pages/TodosPage.tsx",
          "operation": "modify",
          "description": "Add bulk selection functionality with checkboxes for each todo row, select-all checkbox in table header, bulk delete button in toolbar that appears when todos are selected, and TodoBulkUploadDialog trigger button. Follow the bulk operations patterns from frontend/src/pages/TasksPage.tsx and frontend/src/pages/ClientsPage.tsx."
        }
      ]
    },
    {
      "id": "REQ-83",
      "summary": "Display captain name in all task result views immediately after assignee name",
      "acceptanceCriteria": [
        "Tasks page table (frontend/src/pages/TasksPage.tsx) shows both assignee team name and captain name in the Assigned Name column",
        "Task details panel (frontend/src/components/tasks/TaskDetailsPanel.tsx) displays both team name and captain name",
        "Client detail page task list (frontend/src/pages/ClientDetailPage.tsx) shows both team name and captain name for each task",
        "Dashboard task widgets show both team name and captain name where assignee is displayed",
        "Format is clear and readable (e.g., 'Team Name (Captain: Captain Name)' or 'Team Name - Captain Name')",
        "When a task has an assignee name that matches an existing Assignee record, the captain is looked up and displayed; when assignee is free-text with no matching team, only the assignee name is shown",
        "Excel export includes both team name and captain name in the assignee column"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/tasks.ts",
          "operation": "modify",
          "description": "Update useGetAllTasks hook to call getAllTasksWithCaptain backend method instead of getAllTasks, returning Array<TaskWithCaptain> which includes both task data and resolved captainName. Update the query key and response type accordingly."
        },
        {
          "path": "frontend/src/utils/taskDisplay.ts",
          "operation": "modify",
          "description": "Add formatAssigneeWithCaptain utility function that takes assignedName (string or undefined) and captainName (string or undefined) and returns formatted display string. Format as 'Team Name (Captain: Captain Name)' when both are present, 'Team Name' when only assignedName exists, or placeholder '—' when neither exists."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Update the Assigned Name column rendering to display both assignee name and captain name using the formatAssigneeWithCaptain utility. Access captainName from the TaskWithCaptain response type returned by useGetAllTasks."
        },
        {
          "path": "frontend/src/components/tasks/TaskDetailsPanel.tsx",
          "operation": "modify",
          "description": "Update the Assigned Team field rendering to display both assignee name and captain name using the formatAssigneeWithCaptain utility. Accept captainName as an optional prop in the component interface."
        },
        {
          "path": "frontend/src/pages/ClientDetailPage.tsx",
          "operation": "modify",
          "description": "Update the task list table rendering in the client detail view to display both assignee name and captain name in the Assigned Name column using formatAssigneeWithCaptain utility. Ensure the tasks query uses getAllTasksWithCaptain and passes captainName to the display logic."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Update the upcoming tasks and overdue tasks widgets to display both assignee name and captain name wherever assignee is shown. Use formatAssigneeWithCaptain utility for consistent formatting. Ensure the tasks query uses getAllTasksWithCaptain."
        },
        {
          "path": "frontend/src/utils/taskExcel.ts",
          "operation": "modify",
          "description": "Update the Excel export function to include captain name in the Assigned Name column by using formatAssigneeWithCaptain utility when converting TaskWithCaptain data to Excel rows. Ensure the combined assignee and captain information is exported in a single readable column."
        }
      ]
    }
  ]
}